export interface Restaurant {
  id: number;
  name: string;
  address: string;
  phone: string;
  category: string;
  subCategory?: string;
  menu: string;
  lat: number;
  lng: number;
  isGeocoded?: boolean;
  couponType?: "both" | "a_only" | "none" | string;
  mall?: string;
}

export const ADDRESS_COORDINATES: Record<string, { lat: number; lng: number }> = {
  "大原１－１－１０": { lat: 35.87616, lng: 139.515485 },
  "大原１－１－１１": { lat: 35.876099, lng: 139.515615 },
  "大原１－１－１６": { lat: 35.876209, lng: 139.516168 },
  "大原１－２－１５": { lat: 35.877562, lng: 139.517371 },
  "上福岡１－１－１": { lat: 35.874105, lng: 139.511399 },
  "上福岡１－２－１１": { lat: 35.873053, lng: 139.513315 },
  "上福岡１－２－１９": { lat: 35.873353, lng: 139.513279 },
  "上福岡１－２－２５": { lat: 35.873846, lng: 139.512359 },
  "上福岡１－４－１": { lat: 35.873738, lng: 139.513191 },
  "上福岡１－６－１７ 友和ビル１F": { lat: 35.87499, lng: 139.513546 },
  "上福岡１－６－２０": { lat: 35.875069, lng: 139.513265 },
  "上福岡１－６－２６": { lat: 35.874362, lng: 139.512798 },
  "上福岡１－６－２８": { lat: 35.874122, lng: 139.512848 },
  "上福岡１－６－２８ 千代田ビル１階": { lat: 35.874141, lng: 139.512828 },
  "上福岡１－６－３４ DMビル３F": { lat: 35.874267, lng: 139.513202 },
  "上福岡１－８－１６ 新井ビル１０１号": { lat: 35.875795, lng: 139.511935 },
  "上福岡１－８－１２ ホシノビル１F": { lat: 35.87556, lng: 139.512392 },
  "上福岡１－１０－２ エーデルビル１Ｆ": { lat: 35.875976, lng: 139.511934 },
  "上福岡１－１０－２ エーデルビル２Ｆ": { lat: 35.875984, lng: 139.511913 },
  "上福岡１－１０－１０ 内田ビル１０１": { lat: 35.875846, lng: 139.512844 },
  "上福岡１－１１－１": { lat: 35.875326, lng: 139.513219 },
  "上福岡１－１１－８": { lat: 35.875722, lng: 139.513396 },
  "上福岡１－１１－２２": { lat: 35.876743, lng: 139.513665 },
  "上福岡１－１１－２６": { lat: 35.876237, lng: 139.513301 },
  "上福岡１－１２－２": { lat: 35.875207, lng: 139.513549 },
  "上福岡１－１２－１２": { lat: 35.875928, lng: 139.514472 },
  "上福岡１－１２－１５": { lat: 35.876234, lng: 139.514695 },
  "上福岡１－１２－１８": { lat: 35.876431, lng: 139.514562 },
  "上福岡１－１２－２５": { lat: 35.876138, lng: 139.514073 },
  "上福岡１－１２－２５ 小町ビル１F": { lat: 35.876006, lng: 139.513992 },
  "上福岡１－１２－２７バンキャビオン": { lat: 35.875897, lng: 139.513902 },
  "上福岡１－１４－３": { lat: 35.874939, lng: 139.514246 },
  "上福岡１－１４－２８": { lat: 35.875199, lng: 139.514727 },
  "上福岡１－１５－１１": { lat: 35.875837, lng: 139.515932 },
  "上福岡１－１４－２１": { lat: 35.875679, lng: 139.515499 },
  "上福岡３－６－７": { lat: 35.872907, lng: 139.515327 },
  "上福岡３－７－１３": { lat: 35.872913, lng: 139.517024 },
  "上福岡３－７－１４": { lat: 35.872641, lng: 139.516417 },
  "上福岡５－１－１５": { lat: 35.871782, lng: 139.513067 },
  "上福岡５－１－１０プランドールふじみの102": { lat: 35.872299, lng: 139.512557 },
  "上福岡５－１－１０プランドールふじみの201": { lat: 35.872386, lng: 139.512576 },
  "上福岡５－９－１７": { lat: 35.868032, lng: 139.510275 },
  "上福岡６－１－２": { lat: 35.872747, lng: 139.511709 },
  "上福岡６－１－２０ 大原ビル１０１": { lat: 35.871841, lng: 139.511388 },
  "霞ヶ丘１－４": { lat: 35.874128, lng: 139.510456 },
  "霞ヶ丘１－５－１５": { lat: 35.87318, lng: 139.509514 },
  "中福岡２７０－１": { lat: 35.875492, lng: 139.535692 },
  "上野台１－２－３": { lat: 35.876978, lng: 139.517361 },
  "富士見台１－１０": { lat: 35.872532, lng: 139.521515 },
  "駒林１９５－３": { lat: 35.868784, lng: 139.530588 },
  "福岡武蔵野１－１０": { lat: 35.867757, lng: 139.512527 },
  "福岡武蔵野６－１７": { lat: 35.868031, lng: 139.512003 },
  "福岡中央２－１－３": { lat: 35.872747, lng: 139.517473 },
  "鶴ヶ舞３ー５－２": { lat: 35.866416, lng: 139.507997 },
  "鶴ヶ舞３－６－１５": { lat: 35.868257, lng: 139.506483 },
  "鶴ヶ舞３－８－１０": { lat: 35.870146, lng: 139.505064 },
  "鶴ヶ岡２－２５－２５": { lat: 35.867183, lng: 139.506811 },
  "鶴ヶ岡２－２６－２３": { lat: 35.86609, lng: 139.507619 },
  "鶴ヶ岡２－２８－２８": { lat: 35.86533, lng: 139.508192 },
  "ふじみ野２－１－５": { lat: 35.861038, lng: 139.512125 },
  "ふじみ野２－１－６４": { lat: 35.86081, lng: 139.512439 },
  "ふじみ野２－２５－１": { lat: 35.862248, lng: 139.516675 },
  "ふじみ野２－２５－３３": { lat: 35.862602, lng: 139.517838 },
  "ふじみ野２－２５－３６": { lat: 35.86252, lng: 139.517559 },
  "ふじみ野３－１－１": { lat: 35.86126, lng: 139.514664 },
  "ふじみ野３－４－１０": { lat: 35.862132, lng: 139.517568 },
  "ふじみ野３－10－26": { lat: 35.859882, lng: 139.515823 },
  "亀久保１－１－２２": { lat: 35.858521, lng: 139.508711 },
  "亀久保３－１－５": { lat: 35.859404, lng: 139.509441 },
  "亀久保３－１２－４６": { lat: 35.861558, lng: 139.511257 },
  "亀久保４－７－２０": { lat: 35.858884, lng: 139.5127 },
  "亀久保１１３６－２４": { lat: 35.85358, lng: 139.505169 },
  "苗間１－１０－３３": { lat: 35.857567, lng: 139.522469 },
  "苗間１－１３－３５": { lat: 35.856813, lng: 139.520912 },
  "苗間２９５－１": { lat: 35.861116, lng: 139.528064 },
  "苗間３７２－９": { lat: 35.859091, lng: 139.528915 },
  "苗間３７２－１０": { lat: 35.859044, lng: 139.528951 },
  "苗間５８５－１１４": { lat: 35.863261, lng: 139.534259 },
  "苗間５９５－５": { lat: 35.862699, lng: 139.533116 },
  "大井１－５－９": { lat: 35.851239, lng: 139.517235 },
  "旭１－１４－２６": { lat: 35.856396, lng: 139.519588 },
  "うれし野１－３－８": { lat: 35.854789, lng: 139.517941 },
  "うれし野２－５－１８ ２F": { lat: 35.856817, lng: 139.522733 },
  "市沢２－１４－２１": { lat: 35.853693, lng: 139.525321 },
  "大井中央４－８－１３": { lat: 35.859945, lng: 139.502011 },
};

export const RAW_RESTAURANTS = [
{ id: 1, name: "おこのみ亭", address: "大原１－１－１０", phone: "263-5020", category: "お好み焼き・たこ焼き", menu: "広島流・大阪流お好み焼きなど" },
  { id: 2, name: "寿司のえびす", address: "大原１－１－１１", phone: "266-1043", category: "和食・寿司・魚料理", menu: "寿司" },
  { id: 3, name: "焼肉さんあい 上福岡店", address: "大原１－１－１６", phone: "269-3129", category: "焼肉・肉料理", menu: "焼肉" },
  { id: 4, name: "ネオ アマーレ", address: "大原１－２－１５", phone: "261-7196", category: "洋食・イタリアン", menu: "パスタ、ピザ" },
  { id: 5, name: "居酒屋ビッグ 上福岡西口店", address: "上福岡１－１－１", phone: "256-5055", category: "居酒屋・バー", menu: "酒類、肉類、魚" },
  { id: 6, name: "博龍", address: "上福岡１－２－１１", phone: "261-1467", category: "ラーメン・中華", menu: "餃子､ラーメン､チャーハン" },
  { id: 7, name: "上福岡酒遊 ほがらか", address: "上福岡１－２－１９", phone: "080-4118-1159", category: "和食・郷土料理", menu: "ちゃんこ鍋" },
  { id: 8, name: "居酒屋さぶちゃん", address: "上福岡１－２－２５", phone: "263-0100", category: "居酒屋・バー", menu: "アルコール飲料、一品料理（やきとり、煮込み等）" },
  { id: 9, name: "ジジの、村", address: "上福岡１－４－１", phone: "090-4933-0651", category: "居酒屋・バー", menu: "もつ煮、焼魚、やきとり、お酒など" },
  { id: 10, name: "(Ref.)黄河菜館プラス", address: "上福岡１－６－１７ 友和ビル１F", phone: "261-3280", category: "ラーメン・中華", menu: "中華料理全般" },
  { id: 11, name: "ダイニングレストラン天空", address: "上福岡１－６－２０", phone: "262-7271", category: "ラーメン・中華", menu: "中華料理" },
  { id: 12, name: "ワンズワンコーヒー", address: "上福岡１－６－２６", phone: "265-6368", category: "カフェ・喫茶", menu: "コーヒー他各種ドリンク、フード" },
  { id: 13, name: "焼肉ホドリ", address: "上福岡１－６－２８", phone: "261-9255", category: "焼肉・肉料理", menu: "焼肉、キムチなど" },
  { id: 14, name: "日高屋 上福岡店", address: "上福岡１－６－２８ 千代田ビル１階", phone: "262-8500", category: "ラーメン・中華", menu: "ラーメン、餃子、定食" },
  { id: 15, name: "磯料理 豊漁", address: "上福岡１－６－３４ DMビル３F", phone: "266-6550", category: "和食・寿司・魚料理", menu: "各種アルコール飲料、お刺身、一品料理など" },
  { id: 16, name: "レザン", address: "上福岡１－８－１６ 新井ビル１０１号", phone: "263-2015", category: "洋食・イタリアン", menu: "ワイン、食事" },
  { id: 17, name: "アリガトウヤ ココロ", address: "上福岡１－８－１２ ホシノビル１F", phone: "293-5123", category: "居酒屋・バー", menu: "飲料、調理食品" },
  { id: 18, name: "欧風居酒屋ぶーふーうー", address: "上福岡１－10－２ エーデルビル１Ｆ", phone: "261-9859", category: "居酒屋・バー", menu: "酒（ビール、ウィスキー、カクテル、焼酎）、ピザ、パスタ、オムレツ" },
  { id: 19, name: "隠れ家 どん亭", address: "上福岡１－10－２ エーデルビル２Ｆ", phone: "265-5291", category: "居酒屋・バー", menu: "お酒､お料理" },
  { id: 20, name: "ダイニング絆", address: "上福岡１－10－10 内田ビル１０１", phone: "269-5677", category: "居酒屋・バー", menu: "もつ鍋、明太子入りだし巻卵、生ビール、酒類、ハラミ、チキン南蛮" },
  { id: 21, name: "炭火焼鳥小江戸鳥や", address: "上福岡１－１１－１", phone: "080-3210-8866", category: "居酒屋・バー", menu: "焼鳥など" },
  { id: 22, name: "竹むら", address: "上福岡１－１１－８", phone: "261-2879", category: "和食・そば・うどん", menu: "そば、うどん、ご飯物" },
  { id: 23, name: "創作割烹 旬菜", address: "上福岡１－１１－２２", phone: "266-3023", category: "和食・寿司・魚料理", menu: "発酵食品" },
  { id: 24, name: "定食屋ほとり", address: "上福岡１－１１－２６", phone: "267-7505", category: "和食・そば・うどん", menu: "和食、洋食" },
  { id: 25, name: "㈱魚利 大漁船", address: "上福岡１－１２－２", phone: "266-6718", category: "和食・寿司・魚料理", menu: "魚介料理、酒類" },
  { id: 26, name: "居酒屋にし上", address: "上福岡１－１２－１２", phone: "265-0477", category: "居酒屋・バー", menu: "刺身、焼トリ､ 煮込" },
  { id: 27, name: "大番", address: "上福岡１－１２－１５", phone: "262-1718", category: "ラーメン・中華", menu: "ラーメン ギョウザ" },
  { id: 28, name: "珍華", address: "上福岡１－１２－１８", phone: "262-1755", category: "ラーメン・中華", menu: "ラーメン、五目、チャーシューメン、チャーハン、焼肉丼他" },
  { id: 29, name: "もともと", address: "上福岡１－１２－２５", phone: "263-7115", category: "和食・寿司・魚料理", menu: "海鮮、寿司、焼き鳥 等" },
  { id: 30, name: "潤寅", address: "上福岡１－１２－２５ 小町ビル１F", phone: "090-5412-9413", category: "居酒屋・バー", menu: "ホルモン、焼肉居酒屋" },
  { id: 31, name: "ジンギスカン万年･とん國", address: "上福岡１－１２－２７バンキャビオン", phone: "264-1380", category: "焼肉・肉料理", menu: "とんかつ、ジンギスカン、酒、他" },
  { id: 32, name: "ファンタジー３", address: "上福岡１－１４－３", phone: "080-9991-8420", category: "その他", menu: "おにぎり、弁当、そうざい、ちょいのみ" },
  { id: 33, name: "やきとり大興", address: "上福岡１－１４－２８", phone: "261-6564", category: "居酒屋・バー", menu: "焼鳥、ビール" },
  { id: 34, name: "中華そば わた辺", address: "上福岡１－１５－１１", phone: "090-2474-3442", category: "ラーメン・中華", menu: "ラーメン" },
  { id: 35, name: "MOON SIDE COFFEE", address: "上福岡１－１４－２１", phone: "050-3637-1421", category: "カフェ・喫茶", menu: "コーヒー、ベーグル" },
  { id: 36, name: "ホルモン丸和", address: "上福岡３－６－７", phone: "269-6100", category: "焼肉・肉料理", menu: "ホルモン焼き､お酒など" },
  { id: 37, name: "食事処 野ざわ", address: "上福岡３－７－１３", phone: "090-8586-8057", category: "居酒屋・バー", menu: "刺身、焼鳥" },
  { id: 38, name: "(有)旭庵 甚五郎", address: "上福岡３－７－１４", phone: "261-1274", category: "和食・そば・うどん", menu: "天ぷらそば、かも南蛮そば" },
  { id: 39, name: "江戸切そば 英", address: "上福岡５－１－１５", phone: "264-2126", category: "和食・そば・うどん", menu: "そば、酒" },
  { id: 40, name: "氷処 ハナミズキ", address: "上福岡５－１－１０プランドールふじみの102", phone: "なし", category: "カフェ・喫茶", menu: "かき氷、あんみつ" },
  { id: 41, name: "居酒屋 泡盛 こんぺき", address: "上福岡５－１－１０プランドールふじみの201", phone: "090-1555-7143", category: "居酒屋・バー", menu: "泡盛" },
  { id: 42, name: "しょうざん 大穀", address: "上福岡５－９－１７", phone: "264-7151", category: "和食・そば・うどん", menu: "和食料理、飲み物、デザート" },
  { id: 43, name: "Happincss Coffee", address: "上福岡６－１－２", phone: "080-1278-2326", category: "カフェ・喫茶", menu: "ハンドドリップコーヒー、自家焙煎珈琲" },
  { id: 44, name: "ぬいぐるみと繋がるカフェ トンキーズカフェ", address: "上福岡６－１－２０ 大原ビル１０１", phone: "090-5515-0707", category: "カフェ・喫茶", menu: "定食、ドリンク、酒、スイーツ" },
  { id: 45, name: "イタリアンバルＫｅｎｔｉｎａ", address: "霞ヶ丘１－４", phone: "257-5225", category: "洋食・イタリアン", menu: "パスタ、ワイン、おつまみ" },
  { id: 46, name: "大衆酒場だいすけ", address: "霞ヶ丘１－５－１５", phone: "265-6900", category: "居酒屋・バー", menu: "お酒、やきとり、一品料理 等" },
  { id: 47, name: "フライングガーデンふじみ野店", address: "中福岡２７０－１", phone: "256-5122", category: "洋食・イタリアン", menu: "ハンバーガーレストラン" },
  { id: 48, name: "トマトアンドオニオン上福岡店", address: "上野台１－２－３", phone: "269-6113", category: "洋食・イタリアン", menu: "ファミリーレストラン" },
  { id: 49, name: "大むら", address: "富士見台１－１０", phone: "261-3458", category: "和食・そば・うどん", menu: "日本そば" },
  { id: 50, name: "うな膳", address: "駒林１９５－３", phone: "263-9816", category: "和食・寿司・魚料理", menu: "うなぎ" },
  { id: 51, name: "居酒屋 煮こにこ", address: "福岡武蔵野１－１０", phone: "266-7525", category: "居酒屋・バー", menu: "お酒、料理など" },
  { id: 52, name: "（有）亀昇 懐石料理露﨑・亀寿司", address: "福岡武蔵野６－１７", phone: "261-5262", category: "和食・寿司・魚料理", menu: "和食（日本料理、寿司）" },
  { id: 53, name: "ダイニングバー ポートエレン", address: "福岡中央２－１－３", phone: "070-8933-8305", category: "居酒屋・バー", menu: "酒類、食事" },
  { id: 54, name: "プレミアムカルビ ふじみ野店", address: "鶴ヶ舞３ー５－２", phone: "256-6929", category: "焼肉・肉料理", menu: "焼肉＆デザート" },
  { id: 55, name: "舞鶴", address: "鶴ヶ舞３－６－１５", phone: "263-6311", category: "その他", menu: "定食 他" },
  { id: 56, name: "道とん堀ふじみ野店", address: "鶴ヶ舞３－８－１０", phone: "293-9678", category: "お好み焼き・たこ焼き", menu: "お好み焼き、もんじゃ焼き" },
  { id: 57, name: "ステーキ宮 上福岡店", address: "鶴ヶ岡２－２５－２５", phone: "237-6108", category: "洋食・イタリアン", menu: "ステーキ、ハンバーグ" },
  { id: 58, name: "鑫香源 中華料理", address: "鶴ヶ岡２－２６－２３", phone: "215-7205", category: "ラーメン・中華", menu: "中華料理" },
  { id: 59, name: "㈱木曽路 ふじみ野店", address: "鶴ヶ岡２－２８－２８", phone: "278-7060", category: "和食・寿司・魚料理", menu: "和食、しゃぶしゃぶ" },
  { id: 60, name: "びっくりドンキー 上福岡店", address: "ふじみ野２－１－５", phone: "267-2000", category: "洋食・イタリアン", menu: "ハンバーガー、サラダ、デザート、ドリンク" },
  { id: 61, name: "焼肉さんあい ふじみ野店", address: "ふじみ野２－１－６４", phone: "266-3133", category: "焼肉・肉料理", menu: "焼肉" },
  { id: 62, name: "横浜中華 王記厨房 ふじみ野店", address: "ふじみ野２－２５－１", phone: "293-8866", category: "ラーメン・中華", menu: "中華料理" },
  { id: 63, name: "インド・アジアン料理 ダナパニ ふじみ野本店", address: "ふじみ野２－２５－３３", phone: "262-2510", category: "洋食・イタリアン", menu: "カレー、ナン、チキン、ドリンク" },
  { id: 64, name: "にぎり長次郎 ふじみ野店", address: "ふじみ野２－２５－３６", phone: "256-8566", category: "和食・寿司・魚料理", menu: "寿司" },
  { id: 65, name: "和牛焼肉 凱旋門 ふじみ野店", address: "ふじみ野３－１－１", phone: "264-4129", category: "焼肉・肉料理", menu: "黒毛和牛、お酒など" },
  { id: 66, name: "国産うなぎ専門店｢一味亭｣", address: "ふじみ野３－４－１０", phone: "262-5321", category: "和食・寿司・魚料理", menu: "うなぎ" },
  { id: 67, name: "コメダ珈琲店ふじみ野店", address: "ふじみ野３－１０－２６", phone: "267-1695", category: "カフェ・喫茶", menu: "コーヒー、サンドイッチ、ケーキ、ソフトクリーム" },
  { id: 68, name: "麺飯店 貴一", address: "亀久保１－１－２２", phone: "263-2713", category: "ラーメン・中華", menu: "ラーメン、中華定食" },
  { id: 69, name: "牛国屋 ふじみ野店", address: "亀久保３－１－５", phone: "293-8729", category: "焼肉・肉料理", menu: "焼肉" },
  { id: 70, name: "（有）美可美", address: "亀久保３－１２－４６", phone: "264-7141", category: "和食・そば・うどん", menu: "和食" },
  { id: 71, name: "（有）㐂久家", address: "亀久保４－７－２０", phone: "261-3496", category: "和食・そば・うどん", menu: "そば、うどん、定食、丼物" },
  { id: 72, name: "浅野屋", address: "亀久保１１３６－２４", phone: "264-2355", category: "和食・そば・うどん", menu: "そば、うどん、丼" },
  { id: 73, name: "モスバーガー ふじみ野店", address: "苗間１－10－３３", phone: "266-8776", category: "洋食・イタリアン", menu: "ハンバーガー、ポテト" },
  { id: 74, name: "インド・アジアン料理 ダナパニ ふじみ野苗間店", address: "苗間１－１３－３５", phone: "261-6390", category: "洋食・イタリアン", menu: "カレー、ナン、チキン、ドリンク" },
  { id: 75, name: "蕎麦処 天和庵", address: "苗間２９５－１", phone: "262-0801", category: "和食・そば・うどん", menu: "そば" },
  { id: 76, name: "Ｇｒａｕ Ｃｒａｆｔ ｂｅｅｒ ｂａｒ", address: "苗間３７２－９", phone: "293-3441", category: "居酒屋・バー", menu: "クラフトビール、スパイスカレー、燻製等" },
  { id: 77, name: "やきとん なつ屋", address: "苗間３７２－10", phone: "267-4411", category: "居酒屋・バー", menu: "やきとん串、牛モツ煮込み、他料理" },
  { id: 78, name: "Cafe and gift DanD", address: "苗間５８５－１１４", phone: "270-9293", category: "カフェ・喫茶", menu: "ケーキ類､コーヒー類､ランチ" },
  { id: 79, name: "㈲むさしの篠原そば店", address: "苗間５９５－５", phone: "262-5786", category: "和食・そば・うどん", menu: "セイロそば、天ざる、カツ丼、天丼" },
  { id: 80, name: "朝榮(有) （楽苑）", address: "大井１－５－９", phone: "264-9960", category: "ラーメン・中華", menu: "中華料理" },
  { id: 81, name: "ビストロ ボヌール", address: "旭１－１４－２６", phone: "293-6005", category: "洋食・イタリアン", menu: "フランス料理" },
  { id: 82, name: "餃子の王将 ふじみ野店", address: "うれし野１－３－８", phone: "267-5556", category: "ラーメン・中華", menu: "中華料理" },
  { id: 83, name: "Jam3281", address: "うれし野２－５－１８ ２F", phone: "264-3099", category: "洋食・イタリアン", menu: "カレー" },
  { id: 84, name: "エクトルカフェ", address: "市沢２－14－２１", phone: "090-6343-2010", category: "カフェ・喫茶", menu: "コーヒー､パスタ" },
  { id: 85, name: "麺屋 英", address: "大井中央４－８－13", phone: "263-7645", category: "ラーメン・中華", menu: "つけ麺、ラーメン" },

  // --- 大型店登録店（A券のみ利用可）37店舗 ---
  {
    id: 150,
    name: "サンドラッグ上福岡大原店",
    address: "大原１－１－１５",
    phone: "263-0211",
    category: "ドラッグストア",
    menu: "医薬品、食品、雑貨",
    couponType: "a_only",
    lat: 35.876568,
    lng: 139.516353
  },
  {
    id: 151,
    name: "サンドラッグふじみ野大原店",
    address: "大原２－１－３０",
    phone: "214-6200",
    category: "ドラッグストア",
    menu: "医薬品、食品、雑貨",
    couponType: "a_only",
    lat: 35.880133,
    lng: 139.518508
  },
  {
    id: 152,
    name: "ヤオコー ふじみ野大原店",
    address: "大原２－１－３２",
    phone: "257-6110",
    category: "スーパー・食料品",
    menu: "食品、雑貨類",
    couponType: "a_only",
    lat: 35.880153,
    lng: 139.518429
  },
  {
    id: 153,
    name: "ヤオコー 上福岡西口店",
    address: "霞ヶ丘１－２－２７",
    phone: "256-5711",
    category: "スーパー・食料品",
    menu: "食品、雑貨類。ココネ上福岡内。",
    couponType: "a_only",
    lat: 35.873366,
    lng: 139.510976,
    mall: "ココネ上福岡"
  },
  {
    id: 154,
    name: "カレーハウスCoCo壱番屋",
    address: "霞ヶ丘１－２－３",
    phone: "261-8494",
    category: "洋食・イタリアン",
    menu: "カレーライスなど。ココネ上福岡内。",
    couponType: "a_only",
    lat: 35.873438,
    lng: 139.51056,
    mall: "ココネ上福岡"
  },
  {
    id: 155,
    name: "かみふく酒場ナナホシ",
    address: "霞ヶ丘１－２－３",
    phone: "256-7924",
    category: "居酒屋・バー",
    menu: "飲食物。ココネ上福岡内。",
    couponType: "a_only",
    lat: 35.873636,
    lng: 139.510561,
    mall: "ココネ上福岡"
  },
  {
    id: 156,
    name: "ココマル上福岡",
    address: "霞ヶ丘１－２－３",
    phone: "202-2202",
    category: "その他",
    menu: "日用雑貨品、食料品。ココネ上福岡内。",
    couponType: "a_only",
    lat: 35.873357,
    lng: 139.510306,
    mall: "ココネ上福岡"
  },
  {
    id: 157,
    name: "マツモトキヨシ 上福岡西口店",
    address: "霞ヶ丘１－１００",
    phone: "267-8021",
    category: "ドラッグストア",
    menu: "医薬品、食品、日用品など",
    couponType: "a_only",
    lat: 35.87385,
    lng: 139.509866
  },
  {
    id: 158,
    name: "イオンスタイルふじみ野",
    address: "福岡２－１－６",
    phone: "278-7111",
    category: "商業・ショッピング",
    menu: "衣料品、日用品、食料品など。イオンタウンふじみ野内。",
    couponType: "a_only",
    lat: 35.88084,
    lng: 139.521356,
    mall: "イオンタウンふじみ野"
  },
  {
    id: 159,
    name: "コジマ×ビックカメラ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "267-7511",
    category: "その他",
    menu: "家庭用電気機械器具。イオンタウンふじみ野内。",
    couponType: "a_only",
    lat: 35.880129,
    lng: 139.523217,
    mall: "イオンタウンふじみ野"
  },
  {
    id: 160,
    name: "インド料理 ダナパニ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "293-5011",
    category: "洋食・イタリアン",
    menu: "カレー、ナン、チキン、ドリンク。イオンタウンふじみ野内。",
    couponType: "a_only",
    lat: 35.881151,
    lng: 139.521255,
    mall: "イオンタウンふじみ野"
  },
  {
    id: 161,
    name: "イオンタウンふじみ野",
    address: "福岡２－１－６",
    phone: "256-3002",
    category: "商業・ショッピング",
    menu: "衣料、食品、日用品、電化製品、サービス全般。大型ショッピングモール。",
    couponType: "a_only",
    lat: 35.880606,
    lng: 139.521839,
    mall: "イオンタウンふじみ野"
  },
  {
    id: 162,
    name: "イオンバイク イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "293-3723",
    category: "その他",
    menu: "自転車、販売、修理。イオンタウンふじみ野内。",
    couponType: "a_only",
    lat: 35.879839,
    lng: 139.52298,
    mall: "イオンタウンふじみ野"
  },
  {
    id: 163,
    name: "ヤオコー 上福岡駒林店",
    address: "駒林元町２－１－２０",
    phone: "256-5411",
    category: "スーパー・食料品",
    menu: "食品、雑貨類",
    couponType: "a_only",
    lat: 35.866557,
    lng: 139.524945
  },
  {
    id: 164,
    name: "生鮮市場TOP 鶴ヶ舞店",
    address: "鶴ヶ舞２－２－１７",
    phone: "256-5900",
    category: "スーパー・食料品",
    menu: "食料品、日用雑貨",
    couponType: "a_only",
    lat: 35.865967,
    lng: 139.509765
  },
  {
    id: 165,
    name: "ドラッグストアセキ鶴ヶ舞店",
    address: "鶴ヶ舞２－２－１７",
    phone: "278-1100",
    category: "ドラッグストア",
    menu: "医薬品、食品、雑貨、化粧品",
    couponType: "a_only",
    lat: 35.86584,
    lng: 139.510093
  },
  {
    id: 166,
    name: "上福岡家具センター",
    address: "鶴ヶ舞２－６－１２",
    phone: "264-8611",
    category: "その他",
    menu: "家具",
    couponType: "a_only",
    lat: 35.868975,
    lng: 139.511699
  },
  {
    id: 167,
    name: "リプラ",
    address: "鶴ヶ舞２－６－１２",
    phone: "264-1134",
    category: "その他",
    menu: "業務用品、オーダー家具",
    couponType: "a_only",
    lat: 35.868975,
    lng: 139.511699
  },
  {
    id: 168,
    name: "ベルク大井緑ヶ丘店",
    address: "緑ヶ丘１－５－８",
    phone: "278-1188",
    category: "スーパー・食料品",
    menu: "食料品、酒など",
    couponType: "a_only",
    lat: 35.859409,
    lng: 139.500616
  },
  {
    id: 169,
    name: "スーパービバホーム埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "278-7911",
    category: "その他",
    menu: "日用品、ペット、インテリア、資材など。ビバモール埼玉大井内。",
    couponType: "a_only",
    lat: 35.863963,
    lng: 139.502234,
    mall: "ビバモール埼玉大井"
  },
  {
    id: 170,
    name: "イトーヨーカドー堂 食品館埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "262-5111",
    category: "スーパー・食料品",
    menu: "食料品、衣料品、住まいの品。ビバモール埼玉大井内。",
    couponType: "a_only",
    lat: 35.864771,
    lng: 139.500957,
    mall: "ビバモール埼玉大井"
  },
  {
    id: 171,
    name: "シュープラザ 埼玉大井ビバモール店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "256-8331",
    category: "その他",
    menu: "靴。ビバモール埼玉大井内。",
    couponType: "a_only",
    lat: 35.863244,
    lng: 139.501864,
    mall: "ビバモール埼玉大井"
  },
  {
    id: 172,
    name: "モスバーガー ビバホーム埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "278-7757",
    category: "洋食・イタリアン",
    menu: "ハンバーガー、ポテト。ビバモール埼玉大井内。",
    couponType: "a_only",
    lat: 35.863963,
    lng: 139.502234,
    mall: "ビバモール埼玉大井"
  },
  {
    id: 173,
    name: "カスミ ふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "278-7255",
    category: "スーパー・食料品",
    menu: "食品等。ピアシティふじみ野内。",
    couponType: "a_only",
    lat: 35.863539,
    lng: 139.499627,
    mall: "ピアシティふじみ野"
  },
  {
    id: 174,
    name: "マツモトキヨシ ピアシティふじみ野",
    address: "西鶴ヶ岡２－３－１",
    phone: "256-8585",
    category: "ドラッグストア",
    menu: "医薬品、日用品、化粧品、食品(お酒など含)。ピアシティふじみ野内。",
    couponType: "a_only",
    lat: 35.864192,
    lng: 139.498847,
    mall: "ピアシティふじみ野"
  },
  {
    id: 175,
    name: "ヤマダデンキ テックランドふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "293-1141",
    category: "その他",
    menu: "家電。ピアシティふじみ野内。",
    couponType: "a_only",
    lat: 35.863964,
    lng: 139.499411,
    mall: "ピアシティふじみ野"
  },
  {
    id: 176,
    name: "しまむら ファッションセンターしまむら大井店",
    address: "西鶴ヶ岡２－１－１",
    phone: "278-1387",
    category: "その他",
    menu: "衣料品、日用品",
    couponType: "a_only",
    lat: 35.862879,
    lng: 139.500244
  },
  {
    id: 177,
    name: "イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "261-3101",
    category: "商業・ショッピング",
    menu: "食料品、衣料品、暮らしの品等。大型ショッピングセンター。",
    couponType: "a_only",
    lat: 35.860151,
    lng: 139.514445,
    mall: "イオン大井店"
  },
  {
    id: 178,
    name: "生鮮市場TOP 苗間店",
    address: "苗間４２－５",
    phone: "267-1785",
    category: "スーパー・食料品",
    menu: "食料品、日用雑貨",
    couponType: "a_only",
    lat: 35.853784,
    lng: 139.514961
  },
  {
    id: 179,
    name: "ReMyu",
    address: "うれし野２－10－８７",
    phone: "090-1404-7276",
    category: "カフェ・喫茶",
    menu: "ケーキ、焼き菓子、ドリンク、食事。トナリエふじみ野内。",
    couponType: "a_only",
    lat: 35.858002,
    lng: 139.525021,
    mall: "トナリエふじみ野"
  },
  {
    id: 180,
    name: "ジラフラーチ",
    address: "うれし野２－10－８７",
    phone: "263-7079",
    category: "その他",
    menu: "メンズ・レディース衣料品。トナリエふじみ野内。",
    couponType: "a_only",
    lat: 35.857157,
    lng: 139.524498,
    mall: "トナリエふじみ野"
  },
  {
    id: 181,
    name: "ドラッグ セガミ トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "256-6003",
    category: "ドラッグストア",
    menu: "医薬品、化粧品、日用品。トナリエふじみ野内。",
    couponType: "a_only",
    lat: 35.856696,
    lng: 139.523737,
    mall: "トナリエふじみ野"
  },
  {
    id: 182,
    name: "ロピア ふじみ野店",
    address: "うれし野２－10－８７",
    phone: "261-0298",
    category: "スーパー・食料品",
    menu: "食料品、お酒など。トナリエふじみ野内。",
    couponType: "a_only",
    lat: 35.856505,
    lng: 139.523277,
    mall: "トナリエふじみ野"
  },
  {
    id: 183,
    name: "美容整体 Forchure FUJIMINO",
    address: "うれし野２－10－８７",
    phone: "293-9695",
    category: "その他",
    menu: "フェイシャル複合機。トナリエふじみ野内。",
    couponType: "a_only",
    lat: 35.857041,
    lng: 139.523745,
    mall: "トナリエふじみ野"
  },
  {
    id: 184,
    name: "デコホーム トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "0120-014-210",
    category: "その他",
    menu: "雑貨、日用品など。トナリエふじみ野内。",
    couponType: "a_only",
    lat: 35.85732,
    lng: 139.52488,
    mall: "トナリエふじみ野"
  },
  {
    id: 185,
    name: "学校制服スクールベン トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "265-6036",
    category: "その他",
    menu: "学校制服、体育着、その他学校関連用品。トナリエふじみ野内。",
    couponType: "a_only",
    lat: 35.85755,
    lng: 139.524707,
    mall: "トナリエふじみ野"
  },
  {
    id: 186,
    name: "ケーズデンキ ふじみ野店",
    address: "大井中央２－２０－１",
    phone: "257-5620",
    category: "その他",
    menu: "家庭用電化製品",
    couponType: "a_only",
    lat: 35.856802,
    lng: 139.504272
  },
  {
    id: 86,
    name: "コメダ珈琲店 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-256-3210",
    category: "カフェ・喫茶",
    menu: "名物のシロノワールやボリューム満点のカツパン、ゆったり座れるソファー席が特徴です。",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88075176625663, lng: 139.5217763036241
  },
  {
    id: 87,
    name: "スギ薬局 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-261-4567",
    category: "ドラッグストア",
    menu: "医薬品、化粧品から日用品まで豊富な品揃え。薬剤師が常駐し処方箋も受け付けています。",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88048858256956, lng: 139.52192564999942
  },
  {
    id: 88,
    name: "大戸屋ごはん処 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-7890",
    category: "和食・そば・うどん",
    menu: "黒酢あんかけ炒めや焼き魚など、手作りにこだわった和食定食をリーズナブルに楽しめます。",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88066400006584, lng: 139.5217268281002
  },
  {
    id: 89,
    name: "ノジマ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-263-0111",
    category: "商業・ショッピング",
    menu: "最新家電製品からスマートフォン、日用雑貨まで豊富な品揃えでお客様の快適な生活をサポート。",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88046439816044, lng: 139.52189168132253
  },
  {
    id: 90,
    name: "ヤオコー トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-264-2222",
    category: "スーパー・食料品",
    menu: "新鮮な生鮮食品やお惣菜、自家製パンなど豊富な品揃えで毎日の食卓を豊かに彩ります。",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.8571045925316, lng: 139.5243494149902
  },
  {
    id: 91,
    name: "マツモトキヨシ トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-265-3333",
    category: "ドラッグストア",
    menu: "医薬品、健康食品、人気のカウンセリング化粧品や各種日用品を多数取り揃えております。",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.857214318301864, lng: 139.52446321185016
  },
  {
    id: 92,
    name: "タリーズコーヒー トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-266-4444",
    category: "カフェ・喫茶",
    menu: "世界各国から厳選した豆を使用し一杯ずつ丁寧に淹れるエスプレッソや手作りスイーツが自慢。",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85725053446179, lng: 139.52444562647133
  },
  {
    id: 93,
    name: "餃子の満洲 トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-267-5555",
    category: "ラーメン・中華",
    menu: "国産の食材にこだわった自家製餃子は皮がもちもちでジューシー、テイクアウトも大人気です。",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.857080169969436, lng: 139.5246083867304
  },
  {
    id: 94,
    name: "ヤオコー ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-269-6666",
    category: "スーパー・食料品",
    menu: "上福岡駅直結で大変便利、鮮度抜群の産直野菜や焼きたてのおいしいお惣菜をご提供します。",
    couponType: "a_only", mall: "ココネ上福岡", lat: 35.87323390939332, lng: 139.5109761484627
  },
  {
    id: 95,
    name: "ミスタードーナツ ココネ上福岡ショップ",
    address: "霞ヶ丘１－２－３",
    phone: "049-293-7777",
    category: "その他",
    menu: "大人気のポン・デ・リングやオールドファッション、淹れたてのおかわり自由コーヒーを提供。",
    couponType: "both", mall: "ココネ上福岡", lat: 35.873409141013525, lng: 139.51086720863785
  },
  {
    id: 96,
    name: "マツモトキヨシ ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-257-8888",
    category: "ドラッグストア",
    menu: "駅近くで通いやすい店舗。ポイントカード対応でお買い得な医薬品や化粧品が揃っています。",
    couponType: "a_only", mall: "ココネ上福岡", lat: 35.87331950569035, lng: 139.51112196501103
  },
  {
    id: 97,
    name: "スーパービバホーム 埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-278-9999",
    category: "商業・ショッピング",
    menu: "プロ用の建築資材からガーデニング用品、DIY、日用雑貨、ペット用品まで驚きの品揃え。",
    couponType: "a_only", mall: "ビバモール埼玉大井", lat: 35.86405163278993, lng: 139.5021227522013
  },
  {
    id: 98,
    name: "あじや ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-256-1234",
    category: "ラーメン・中華",
    menu: "ボリューム満点の本格中華。昔ながらの醤油ラーメンや炒飯、餃子のセットがおすすめ。",
    couponType: "both", mall: "ビバモール埼玉大井", lat: 35.864018582461576, lng: 139.50219026882903
  },
  {
    id: 99,
    name: "カスミ フードスクエアふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-261-2345",
    category: "スーパー・食料品",
    menu: "新鮮な生鮮食料品に加え、健康やエコに配慮したオーガニック食品を幅広く品揃えしています。",
    couponType: "a_only", mall: "ピアシティふじみ野", lat: 35.86350512279139, lng: 139.49976856726917
  },
  {
    id: 100,
    name: "ウエルシア ピアシティふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-262-3456",
    category: "ドラッグストア",
    menu: "深夜営業で便利。お薬から日用品、冷凍食品などの食料品も充実した便利な調剤薬局併設店。",
    couponType: "a_only", mall: "ピアシティふじみ野", lat: 35.86346588047359, lng: 139.4996132105776
  },
  {
    id: 101,
    name: "キャンドゥ ピアシティふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-263-4567",
    category: "商業・ショッピング",
    menu: "暮らしを彩る可愛い雑貨から実用的な日用品、便利なアイデアグッズまでオール100円。",
    couponType: "both", mall: "ピアシティふじみ野", lat: 35.86359467846068, lng: 139.49959576066016
  },
  {
    id: 102,
    name: "イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-264-5678",
    category: "スーパー・食料品",
    menu: "食料品、衣料品、住まいと暮らしの品々まで、毎日の暮らしをフルサポートする大型総合スーパー。",
    couponType: "a_only", mall: "イオン大井店", lat: 35.86013049689539, lng: 139.51430305696434
  },
  {
    id: 103,
    name: "未来屋書店 大井店",
    address: "ふじみ野１－２－１",
    phone: "049-265-6789",
    category: "商業・ショッピング",
    menu: "人気の新刊書籍から児童書、学習参考書、各種専門書まで心豊かな読書体験を提供する書店。",
    couponType: "both", mall: "イオン大井店", lat: 35.860098325929364, lng: 139.5144252241527
  },
  {
    id: 104,
    name: "サイゼリヤ イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-266-7890",
    category: "洋食・イタリアン",
    menu: "ミラノ風ドリアやピザ、パスタ、ワインなど本場イタリアの味をリーズナブルにご提供。",
    couponType: "both", mall: "イオン大井店", lat: 35.86017745221947, lng: 139.5144571530337
  },
  {
    id: 105,
    name: "ケンタッキーフライドチキン イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-267-8901",
    category: "その他",
    menu: "秘伝の11種類のスパイスを使用したジューシーなオリジナルチキンを店舗で手づくりしています。",
    couponType: "both", mall: "イオン大井店", lat: 35.860296212754115, lng: 139.5145703472664
  },
  {
    id: 106,
    name: "炭火焼鳥 とりげん 上福岡店",
    address: "上福岡１－５－１２",
    phone: "049-269-9012",
    category: "居酒屋・バー",
    menu: "毎朝仕入れる新鮮な国産鶏を一本一本丁寧に手打ちし、自慢の備長炭で香ばしく焼き上げます。",
    couponType: "both", lat: 35.87601853385598, lng: 139.51749682987958
  },
  {
    id: 107,
    name: "ラーメン 寛",
    address: "苗間１－１３－２０",
    phone: "049-293-0123",
    category: "ラーメン・中華",
    menu: "じっくり煮込んだ特製煮干しスープとモチモチの自家製麺が織りなす極上の醤油ラーメン。",
    couponType: "both", lat: 35.87998830508781, lng: 139.50786512580717
  },
  {
    id: 108,
    name: "チャイナテラス",
    address: "大原２－１－５",
    phone: "049-257-2345",
    category: "ラーメン・中華",
    menu: "カジュアルでありながら本格派の広東料理。プリプリの海老のチリソース炒めが当店一押し。",
    couponType: "both", lat: 35.87308147044609, lng: 139.50693178646648
  },
  {
    id: 109,
    name: "寿し処 いち川",
    address: "鶴ヶ岡３－５－８",
    phone: "049-278-3456",
    category: "和食・寿司・魚料理",
    menu: "豊洲市場直送の新鮮なネタを使用し、職人が魂を込めて握る本格寿司と季節の一品料理。",
    couponType: "both", lat: 35.86853940285713, lng: 139.51636988213053
  },
  {
    id: 110,
    name: "ハチカフェ",
    address: "亀久保４－２－１",
    phone: "049-256-4567",
    category: "カフェ・喫茶",
    menu: "淹れたてのハンドドリップコーヒーと、季節のフルーツをたっぷり使った自家製タルト。",
    couponType: "both", lat: 35.87367112328047, lng: 139.51240205540475
  },
  {
    id: 111,
    name: "美容室アトリエMAO",
    address: "中福岡２－８－３",
    phone: "049-261-5678",
    category: "その他",
    menu: "お客様一人一人の骨格に合わせたオリジナルカット。髪に優しいオーガニックカラーも大人気。",
    couponType: "both", lat: 35.87154613101034, lng: 139.50754259852437
  },
  {
    id: 112,
    name: "ホワイト急便 上福岡駅前店",
    address: "霞ヶ丘１－４－２０",
    phone: "049-262-6789",
    category: "その他",
    menu: "お急ぎの衣類も当日仕上がり可能。確かな技術で大切な衣類を優しくきれいに洗い上げます。",
    couponType: "both", lat: 35.88132177583632, lng: 139.5135436306372
  },
  {
    id: 113,
    name: "ふじみ野内科クリニック",
    address: "ふじみ野東１－２０－５",
    phone: "049-263-7890",
    category: "その他",
    menu: "地域のかかりつけ医として内科全般、予防接種や生活習慣病の指導まで親身に対応いたします。",
    couponType: "both", lat: 35.879534491124346, lng: 139.51656781458476
  },
  {
    id: 114,
    name: "ふじみ野個別指導塾",
    address: "ふじみ野西１－１５－２",
    phone: "049-264-8901",
    category: "その他",
    menu: "小学生から高校生までを対象とした完全マンツーマン指導で、苦手克服と志望校合格を強力支援。",
    couponType: "both", lat: 35.87257506687071, lng: 139.51708708799222
  },
  {
    id: 115,
    name: "ビッグ・エー 上福岡一丁目店",
    address: "上福岡１－１２－２",
    phone: "049-265-9012",
    category: "スーパー・食料品",
    menu: "毎日が驚きの安さ。生鮮食品から日配品、お酒まで無駄を省いたエブリデーロープライスストア。",
    couponType: "a_only", lat: 35.87093995545559, lng: 139.51701465244045
  },
  {
    id: 116,
    name: "ドラッグセイムス ふじみ野店",
    address: "駒林元町３－４－１２",
    phone: "049-266-0123",
    category: "ドラッグストア",
    menu: "富士薬品グループの信頼。風邪薬からコスメ、日用品、食品まで暮らしをサポートする品揃え。",
    couponType: "a_only", lat: 35.874666509950025, lng: 139.51077057834195
  },
  {
    id: 117,
    name: "手打ちそば 砂場",
    address: "うれし野１－８－１",
    phone: "049-267-1234",
    category: "和食・そば・うどん",
    menu: "厳選した国産そば粉を使用し、職人が毎日手打ちする香りと喉越し抜群の極上二八そば。",
    couponType: "both", lat: 35.87528799975505, lng: 139.51599386310897
  },
  {
    id: 118,
    name: "焼肉 炭火苑",
    address: "市沢２－１０－５",
    phone: "049-269-2345",
    category: "焼肉・肉料理",
    menu: "厳選された上質な黒毛和牛。職人が手切りした極上のカルビとタンを特製秘伝タレでどうぞ。",
    couponType: "both", lat: 35.87311247217235, lng: 139.50589685682016
  },
  {
    id: 119,
    name: "トラットリア トリニータ",
    address: "ふじみ野西３－１２－１",
    phone: "049-293-3456",
    category: "洋食・イタリアン",
    menu: "本場仕込みの手打ちパスタと旬の食材を使った薪窯ナポリピッツァが楽しめる一軒家イタリアン。",
    couponType: "both", lat: 35.86977157211945, lng: 139.51647882628393
  },
  {
    id: 120,
    name: "お好み焼き 道とん堀 ふじみ野店",
    address: "大井中央３－１１－１",
    phone: "049-257-4567",
    category: "お好み焼き・たこ焼き",
    menu: "鉄板を囲んでみんなで楽しめる。ふわふわの「ぽんぽこぽん」お好み焼きやもんじゃ焼きが名物。",
    couponType: "both", lat: 35.867691784504856, lng: 139.508915372029
  },
  {
    id: 121,
    name: "サイクルベースあさひ ふじみ野店",
    address: "ふじみ野東３－１３－１",
    phone: "049-278-5678",
    category: "商業・ショッピング",
    menu: "シティサイクル、キッズ自転車から本格的な電動アシスト自転車、スポーツバイクまで網羅。",
    couponType: "a_only", lat: 35.87683016890596, lng: 139.50677144163063
  },
  {
    id: 122,
    name: "ふじみ野湯",
    address: "大井武蔵野１３５７－１",
    phone: "049-256-6789",
    category: "その他",
    menu: "露天風呂や広々としたサウナ、寝湯など多彩なお風呂で、日頃の疲れをのんびり癒やしてリフレッシュ。",
    couponType: "both", lat: 35.87139630292958, lng: 139.51797570777987
  },
  {
    id: 123,
    name: "星乃珈琲店 ふじみ野店",
    address: "鶴ヶ岡２－２８－３",
    phone: "049-261-7890",
    category: "カフェ・喫茶",
    menu: "一杯ずつ丁寧に淹れたこだわりのハンドドリップ珈琲と、名物のふわふわ釜焼きスフレパンケーキ。",
    couponType: "both", lat: 35.87572554639072, lng: 139.51762270035596
  },
  {
    id: 124,
    name: "ラーメン 魁力屋 ふじみ野店",
    address: "大井１－５－８",
    phone: "049-262-8901",
    category: "ラーメン・中華",
    menu: "京都北白川発祥。あっさりしているのにコクと深みがある自慢の背脂醤油ラーメンをご賞味あれ。",
    couponType: "both", lat: 35.86753661254057, lng: 139.51824391348222
  },
  {
    id: 125,
    name: "山田うどん食堂 大井店",
    address: "大井中央１－４－２",
    phone: "049-263-9012",
    category: "和食・そば・うどん",
    menu: "うどん、そば、丼もののセットが安くて大満足。埼玉県民おなじみの手軽で美味しいソウルフード。",
    couponType: "both", lat: 35.87059540236495, lng: 139.51880297567808
  },
  {
    id: 126,
    name: "がってん寿司 大井店",
    address: "ふじみ野１－４－１",
    phone: "049-264-0123",
    category: "和食・寿司・魚料理",
    menu: "市場直送のピチピチ鮮魚を目の前で職人が握る、活気と美味しさがあふれるグルメ回転寿司。",
    couponType: "both", lat: 35.87492739604772, lng: 139.51390662019276
  },
  {
    id: 127,
    name: "ブロンコビリー ふじみ野店",
    address: "うれし野１－３－２",
    phone: "049-265-1234",
    category: "焼肉・肉料理",
    menu: "炭焼きで焼き上げた極厚ジューシーハンバーグと、新鮮な国産野菜が揃う大満足のサラダバー。",
    couponType: "both", lat: 35.875401933350695, lng: 139.5133609994442
  },
  {
    id: 128,
    name: "安楽亭 ふじみ野店",
    address: "大原１－１－１５",
    phone: "049-266-2345",
    category: "焼肉・肉料理",
    menu: "無添加の安全安心なお肉。コスパ最強の焼肉ランチから食べ放題コースまで幅広く楽しめます。",
    couponType: "both", lat: 35.881380262704035, lng: 139.50729143720778
  },
  {
    id: 129,
    name: "目利きの銀次 上福岡東口駅前店",
    address: "上福岡１－２－１４",
    phone: "049-267-3456",
    category: "居酒屋・バー",
    menu: "全国の漁港から直接仕入れる新鮮な海の幸。自分で焼く磯焼きや豪華な海鮮丼を豊富にラインナップ。",
    couponType: "both", lat: 35.86710098301102, lng: 139.50540715812997
  },
  {
    id: 130,
    name: "エリカ",
    address: "上福岡２－３－４",
    phone: "049-269-4567",
    category: "カフェ・喫茶",
    menu: "昭和レトロな雰囲気が漂う落ち着いた純喫茶。手作りのナポリタンと昔ながらのメロンソーダ。",
    couponType: "both", lat: 35.874471152990296, lng: 139.5066000286339
  },
  {
    id: 131,
    name: "クリエイトSD ふじみ野うれし野店",
    address: "うれし野１－５－３",
    phone: "049-293-5678",
    category: "ドラッグストア",
    menu: "地域密着のドラッグストア。医薬品の相談から日用品、冷凍食品、お酒まで毎日が特価価格です。",
    couponType: "a_only", lat: 35.8733793567079, lng: 139.51587925030518
  },
  {
    id: 132,
    name: "西松屋 ふじみ野店",
    address: "大井中央４－８－１",
    phone: "049-257-6789",
    category: "商業・ショッピング",
    menu: "ベビー・キッズ用品専門店。お洋服からおむつ、玩具まで高品質な育児用品を低価格でご提供。",
    couponType: "a_only", lat: 35.86684378407643, lng: 139.514374720428
  },
  {
    id: 133,
    name: "ホワイト急便 苗間店",
    address: "苗間３７２－１",
    phone: "049-278-7890",
    category: "その他",
    menu: "丁寧なシミ抜きとプロのアイロン仕上げ。地域のお客様に長年愛される信頼のクリーニング店。",
    couponType: "both", lat: 35.86664406496642, lng: 139.51343994302408
  },
  {
    id: 134,
    name: "カットファクトリー ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-256-8901",
    category: "その他",
    menu: "早くて親切、丁寧なヘアカット。お出かけついでにサクッと立ち寄れる便利なカット専門店。",
    couponType: "both", mall: "ココネ上福岡", lat: 35.873223976733804, lng: 139.51109519723474
  },
  {
    id: 135,
    name: "大井こどもクリニック",
    address: "大井２－１２－５",
    phone: "049-261-9012",
    category: "その他",
    menu: "小児科専門医が優しく診察します。乳幼児健診、予防接種、お子様の健康トラブルにいつでも対応。",
    couponType: "both", lat: 35.87804380449413, lng: 139.51805243554
  },
  {
    id: 136,
    name: "城南コベッツ ふじみ野教室",
    address: "ふじみ野西１－２４－２",
    phone: "049-262-0123",
    category: "その他",
    menu: "成績保証のある個別指導塾。生徒一人ひとりに合わせた最適カリキュラムで学力向上を徹底サポート。",
    couponType: "both", lat: 35.876038905917966, lng: 139.5159503056763
  },
  {
    id: 137,
    name: "マミーマート 鶴ヶ岡店",
    address: "鶴ヶ岡４－１－３５",
    phone: "049-263-1234",
    category: "スーパー・食料品",
    menu: "産地直送の新鮮野菜や、お肉、美味しい惣菜を豊富に品揃えし、毎日の健康的な食卓を提案します。",
    couponType: "a_only", lat: 35.86917350888583, lng: 139.51358162659776
  },
  {
    id: 138,
    name: "手打ちそば 長寿庵",
    address: "大井中央２－８－１",
    phone: "049-264-2345",
    category: "和食・そば・うどん",
    menu: "伝統の技で打ち上げる香り高き二八そばと、ボリュームたっぷりな揚げたての天ぷらが名物。",
    couponType: "both", lat: 35.87477109625096, lng: 139.51565659178624
  },
  {
    id: 139,
    name: "ピッツェリア・サルーテ",
    address: "苗間１－１０－５",
    phone: "049-265-3456",
    category: "洋食・イタリアン",
    menu: "こだわりの石窯で焼き上げる本格イタリアンピザ。もちもちの生地ととろけるチーズが絶品です。",
    couponType: "both", lat: 35.868399720348016, lng: 139.50478198472413
  },
  {
    id: 140,
    name: "珍来 上福岡店",
    address: "上福岡１－７－２６",
    phone: "049-266-4567",
    category: "ラーメン・中華",
    menu: "伝統のモチモチ手打ち麺と、ボリューム自慢の中華定食。特製大ぶり餃子はお土産にもおすすめ。",
    couponType: "both", lat: 35.869900086912466, lng: 139.50873333734864
  },
  {
    id: 141,
    name: "魚民 上福岡東口駅前店",
    address: "上福岡１－２－６",
    phone: "049-267-5678",
    category: "居酒屋・バー",
    menu: "個室完備で安心・安全に楽しめる。定番のおつまみから新鮮なお刺身まで豊富に揃う和風居酒屋。",
    couponType: "both", lat: 35.88106938004541, lng: 139.51039452844353
  },
  {
    id: 142,
    name: "築地銀だこ イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-269-6789",
    category: "お好み焼き・たこ焼き",
    menu: "外はパリッ、中はトロッ、タコはプリッとした、こだわりたこ焼きをご提供。お買い物帰りのおやつに。",
    couponType: "both", mall: "イオン大井店", lat: 35.86002535891211, lng: 139.51454154359786
  },
  {
    id: 143,
    name: "ロピア ふじみ野店",
    address: "うれし野２－１６－１",
    phone: "049-293-7890",
    category: "スーパー・食料品",
    menu: "驚異の安さとボリューム。元精肉店ならではの高品質なお肉や、驚くほどお得な惣菜が満載。",
    couponType: "a_only", lat: 35.87715108725018, lng: 139.51252373418944
  },
  {
    id: 144,
    name: "EARTH Coiffure Beaute ふじみ野店",
    address: "ふじみ野東１－２１－１",
    phone: "049-257-8901",
    category: "その他",
    menu: "最新トレンドのヘアスタイルからヘアケア、ヘッドスパまでを贅沢空間でお手頃価格にてご提供。",
    couponType: "both", lat: 35.86904770390944, lng: 139.51783712121394
  },
  {
    id: 145,
    name: "ほぐしやさん ふじみ野店",
    address: "亀久保２－２７－１",
    phone: "049-278-9012",
    category: "その他",
    menu: "全身もみほぐしや足つぼマッサージ。経験豊富なセラピストがお客様の疲れを的確にほぐします。",
    couponType: "both", lat: 35.87582969499463, lng: 139.50577815977522
  },
  {
    id: 146,
    name: "TSUTAYA 上福岡店",
    address: "上福岡１－８－８",
    phone: "049-256-0123",
    category: "商業・ショッピング",
    menu: "最新の映画DVD、話題の音楽CD、コミックのレンタルや人気の書籍・雑誌の販売を行っています。",
    couponType: "both", lat: 35.88151360509025, lng: 139.50420328205146
  },
  {
    id: 147,
    name: "ココカラファイン 上福岡店",
    address: "霞ヶ丘１－２－２",
    phone: "049-261-1234",
    category: "ドラッグストア",
    menu: "いきいきとした生活を応援。親切丁寧な接客で医薬品や健康食品、化粧品選びをサポートします。",
    couponType: "a_only", lat: 35.86771438652664, lng: 139.50874674995634
  },
  {
    id: 148,
    name: "サンマルクカフェ トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-262-2345",
    category: "カフェ・喫茶",
    menu: "焼き立てクロワッサン「チョコクロ」と、挽きたて淹れたての本格ドリップコーヒーが絶品。",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85702684521087, lng: 139.5244783775731
  },
  {
    id: 149,
    name: "トイザらス・ベビーザらス ふじみ野店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-263-3456",
    category: "商業・ショッピング",
    menu: "子供向けのおもちゃ、知育玩具、マタニティ・ベビー用品まで国内外の一流ブランドが勢揃い。",
    couponType: "a_only", mall: "ビバモール埼玉大井", lat: 35.86411162464371, lng: 139.5022476532673
  },
  {
    id: 187,
    name: "ヤオコー ふじみ野大原店",
    address: "大原１－２－３",
    phone: "049-261-1234",
    category: "スーパー・食料品",
    menu: "新鮮な地元産野菜やできたての手作りお惣菜各種",
    couponType: "a_only", lat: 35.881586052057195, lng: 139.51690987319404
  },
  {
    id: 188,
    name: "マツモトキヨシ ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-265-5678",
    category: "ドラッグストア",
    menu: "医薬品や化粧品、日用品を豊富に取り揃えております",
    couponType: "a_only", mall: "ココネ上福岡", lat: 35.873512110899334, lng: 139.5110809026244
  },
  {
    id: 189,
    name: "サンマルクカフェ ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-266-9876",
    category: "カフェ・喫茶",
    menu: "焼き立てのチョコクロと淹れたてコーヒーのセット",
    couponType: "both", mall: "ココネ上福岡", lat: 35.87328670153116, lng: 139.51100833719445
  },
  {
    id: 190,
    name: "餃子の王将 ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-256-4321",
    category: "ラーメン・中華",
    menu: "皮はパリッと中はジューシーな名物の手作り餃子",
    couponType: "both", mall: "ココネ上福岡", lat: 35.87346821463827, lng: 139.5109417662218
  },
  {
    id: 191,
    name: "キャンドゥ ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-267-3456",
    category: "商業・ショッピング",
    menu: "暮らしを便利にする100円均一のアイデア生活雑貨",
    couponType: "both", mall: "ココネ上福岡", lat: 35.87337276038939, lng: 139.51083910401877
  },
  {
    id: 192,
    name: "くすりのマツモトキヨシ イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-269-1234",
    category: "ドラッグストア",
    menu: "カウンセリング化粧品や各種常備薬のご相談と販売",
    couponType: "a_only", mall: "イオン大井店", lat: 35.860291196900626, lng: 139.5145696526273
  },
  {
    id: 193,
    name: "未来屋書店 大井店",
    address: "ふじみ野１－２－１",
    phone: "049-264-5678",
    category: "商業・ショッピング",
    menu: "最新の話題書から専門書、学習参考書まで充実の品揃え",
    couponType: "both", mall: "イオン大井店", lat: 35.860092060756934, lng: 139.5145779974534
  },
  {
    id: 194,
    name: "サーティワンアイスクリーム イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-262-1122",
    category: "カフェ・喫茶",
    menu: "季節限定フレーバーなど豊富な種類のアイスクリーム",
    couponType: "both", mall: "イオン大井店", lat: 35.860085915696004, lng: 139.51452610118454
  },
  {
    id: 195,
    name: "マクドナルド イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-263-4455",
    category: "その他",
    menu: "大人気のビッグマックや揚げたてポテトのバリューセット",
    couponType: "a_only", mall: "イオン大井店", lat: 35.86001108405171, lng: 139.5143030293105
  },
  {
    id: 196,
    name: "スターバックスコーヒー イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-261-7788",
    category: "カフェ・喫茶",
    menu: "香り高いエスプレッソと季節限定のフラペチーノ",
    couponType: "a_only", mall: "イオン大井店", lat: 35.86004749935355, lng: 139.5145447571452
  },
  {
    id: 197,
    name: "カスミ フードスクエアピアシティふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-293-4567",
    category: "スーパー・食料品",
    menu: "新鮮な生鮮食品とお買い得なプライベートブランド商品",
    couponType: "a_only", mall: "ピアシティふじみ野", lat: 35.86347722138521, lng: 139.4996264209605
  },
  {
    id: 198,
    name: "サンドラッグ ピアシティふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-257-8901",
    category: "ドラッグストア",
    menu: "各種医薬品や日用消耗品を毎日低価格でご提供します",
    couponType: "a_only", mall: "ピアシティふじみ野", lat: 35.863620186101805, lng: 139.49949268515482
  },
  {
    id: 199,
    name: "ダイソー ピアシティふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-278-2345",
    category: "商業・ショッピング",
    menu: "日々の生活を彩る便利で可愛い100円均一の生活雑貨",
    couponType: "both", mall: "ピアシティふじみ野", lat: 35.86346318213963, lng: 139.49953013413582
  },
  {
    id: 200,
    name: "コジマ×ビックカメラ ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-8899",
    category: "商業・ショッピング",
    menu: "最新の生活家電からスマートフォン、おもちゃまで幅広く販売",
    couponType: "a_only", mall: "ビバモール埼玉大井", lat: 35.863999076946854, lng: 139.50210253577143
  },
  {
    id: 201,
    name: "スーパービバホーム 埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-9900",
    category: "商業・ショッピング",
    menu: "DIY用品から住宅設備、ガーデニング資材まで網羅",
    couponType: "a_only", mall: "ビバモール埼玉大井", lat: 35.863871109401245, lng: 139.50219660719424
  },
  {
    id: 202,
    name: "ケンタッキーフライドチキン ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-269-0011",
    category: "その他",
    menu: "秘伝の11スパイスで仕上げたジューシーなチキンセット",
    couponType: "both", mall: "ビバモール埼玉大井", lat: 35.86405015382608, lng: 139.50215191262305
  },
  {
    id: 203,
    name: "フードワン ゆめみ野店",
    address: "うれし野１－４－１",
    phone: "049-262-5555",
    category: "スーパー・食料品",
    menu: "毎日が特売価格の圧倒的低価格と豊富な食料品ラインナップ",
    couponType: "a_only", lat: 35.86727974002147, lng: 139.50427914984726
  },
  {
    id: 204,
    name: "珈琲館 トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-265-1212",
    category: "カフェ・喫茶",
    menu: "職人が丁寧に淹れた本格炭火珈琲と昔ながらのホットケーキ",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85724649543558, lng: 139.52436493842768
  },
  {
    id: 205,
    name: "カルディコーヒーファーム トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-266-3434",
    category: "スーパー・食料品",
    menu: "世界各国の珍しい輸入食品やこだわり焙煎のコーヒー豆",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85704823373791, lng: 139.524417541064
  },
  {
    id: 206,
    name: "ハニーズ トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-267-5656",
    category: "商業・ショッピング",
    menu: "リーズナブルでトレンドを押さえた人気レディースウェア",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85724998706676, lng: 139.52464080331328
  },
  {
    id: 207,
    name: "シュープラザ トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-261-7878",
    category: "商業・ショッピング",
    menu: "人気ブランドスニーカーからビジネスシューズまでの豊富な品揃え",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.857053081140144, lng: 139.52440150413142
  },
  {
    id: 208,
    name: "ヤオコー イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-256-8080",
    category: "スーパー・食料品",
    menu: "新鮮な鮮魚コーナーと店内で手作りの極厚メンチカツ",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88058036682147, lng: 139.52196758251327
  },
  {
    id: 209,
    name: "スギ薬局 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-263-9090",
    category: "ドラッグストア",
    menu: "調剤受付も行う地域密着型の安心と信頼のドラッグストア",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88058556245817, lng: 139.52177775428856
  },
  {
    id: 210,
    name: "倉式珈琲店 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-0101",
    category: "カフェ・喫茶",
    menu: "サイフォンで一杯ずつ丁寧に抽出した香り高いプレミアム珈琲",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88058616264282, lng: 139.52189813707932
  },
  {
    id: 211,
    name: "バーガーキング イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-265-3030",
    category: "その他",
    menu: "直火焼き100%ビーフパティを使用した本格ワッパーバーガー",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.880652212940575, lng: 139.5217058678799
  },
  {
    id: 212,
    name: "大戸屋ごはん処 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-264-5050",
    category: "和食・そば・うどん",
    menu: "黒酢あんかけが絶品の栄養バランスを考えた和食定食",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88070820065688, lng: 139.52195996427358
  },
  {
    id: 213,
    name: "リンガーハット イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-266-7070",
    category: "ラーメン・中華",
    menu: "国産野菜をたっぷり100%使用した長崎ちゃんぽん",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88052820138501, lng: 139.52181965761483
  },
  {
    id: 214,
    name: "はなまるうどん イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-267-9090",
    category: "和食・そば・うどん",
    menu: "本場讃岐のコシの強い生麺と温かいこだわりお出汁のうどん",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88048816806486, lng: 139.52183602332153
  },
  {
    id: 215,
    name: "ロピア トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-256-2929",
    category: "スーパー・食料品",
    menu: "圧倒的なボリュームと安さを誇る精肉とデカ盛り惣菜",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.857122855015, lng: 139.5244985299553
  },
  {
    id: 216,
    name: "お好み焼き 道とん堀 ふじみ野店",
    address: "大井中央３－１－１",
    phone: "049-263-1212",
    category: "お好み焼き・たこ焼き",
    menu: "みんなでワイワイ焼いて楽しむアツアツの定番お好み焼き",
    couponType: "both", lat: 35.86809970564334, lng: 139.51495503005685
  },
  {
    id: 217,
    name: "ラーメン魁力屋 ふじみ野店",
    address: "鶴ヶ岡３－１５－２",
    phone: "049-269-8877",
    category: "ラーメン・中華",
    menu: "コクがあるのにあっさりとした特製醤油ラーメンと特製焼き飯",
    couponType: "both", lat: 35.86786605431967, lng: 139.51751057284216
  },
  {
    id: 218,
    name: "珍来 上福岡店",
    address: "上福岡１－２－２４",
    phone: "049-261-2244",
    category: "ラーメン・中華",
    menu: "モチモチの自家製極太手打ち麺とボリューム満点の中華定食",
    couponType: "both", lat: 35.87296890746065, lng: 139.50695032882388
  },
  {
    id: 219,
    name: "居酒屋 どん 上福岡駅前店",
    address: "上福岡１－６－３",
    phone: "049-262-3344",
    category: "居酒屋・バー",
    menu: "豊洲市場直送の新鮮なお刺身と一本一本手打ちの焼き鳥",
    couponType: "both", lat: 35.8734121106214, lng: 139.5109600318571
  },
  {
    id: 220,
    name: "鳥貴族 上福岡店",
    address: "上福岡１－７－３",
    phone: "049-264-5566",
    category: "居酒屋・バー",
    menu: "全品均一価格で楽しめる国産鶏肉を使用したジューシーな貴族焼",
    couponType: "both", lat: 35.88058000970995, lng: 139.5155178025122
  },
  {
    id: 221,
    name: "スシロー ふじみ野店",
    address: "亀久保３－１４－５",
    phone: "049-278-8811",
    category: "和食・寿司・魚料理",
    menu: "新鮮な旬のネタをリーズナブルに味わえる大人気の回転寿司",
    couponType: "a_only", lat: 35.87196883947765, lng: 139.5146353733671
  },
  {
    id: 222,
    name: "藍屋 ふじみ野店",
    address: "ふじみ野１－１－１",
    phone: "049-263-8899",
    category: "和食・寿司・魚料理",
    menu: "厳選した旬の魚介を使用した本格お刺身とサクサク天ぷら膳",
    couponType: "a_only", lat: 35.86953855680046, lng: 139.51489843741157
  },
  {
    id: 223,
    name: "華屋与兵衛 大井町店",
    address: "大井１－５－５",
    phone: "049-266-2233",
    category: "和食・そば・うどん",
    menu: "のどごしの良い美味しい和そばとサクサクミニ天丼のセット",
    couponType: "a_only", lat: 35.86705928137116, lng: 139.5120485652494
  },
  {
    id: 224,
    name: "馬車道 ふじみ野店",
    address: "市沢１－２－１",
    phone: "049-261-5544",
    category: "洋食・イタリアン",
    menu: "特製デミグラスでじっくり煮込んだ手ごねハンバーグステーキ",
    couponType: "both", lat: 35.869633567578155, lng: 139.50898760099008
  },
  {
    id: 225,
    name: "ガスト 上福岡店",
    address: "上福岡５－２－１",
    phone: "049-262-7788",
    category: "洋食・イタリアン",
    menu: "とろける10種のチーズがたっぷり詰まった特製ハンバーグ",
    couponType: "a_only", lat: 35.874532536755844, lng: 139.51774368181427
  },
  {
    id: 226,
    name: "サイゼリヤ ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-265-9988",
    category: "洋食・イタリアン",
    menu: "人気ナンバーワンのミラノ風ドリアと味わい深いイタリアワイン",
    couponType: "a_only", mall: "ココネ上福岡", lat: 35.87323099077339, lng: 139.51112073429104
  },
  {
    id: 227,
    name: "ドトールコーヒーショップ 上福岡西口店",
    address: "霞ヶ丘１－１－１",
    phone: "049-263-7766",
    category: "カフェ・喫茶",
    menu: "直火焙煎の香ばしいコーヒーとサクサクのジャーマンドック",
    couponType: "both", lat: 35.868393189256174, lng: 139.5039398713174
  },
  {
    id: 228,
    name: "モスバーガー 上福岡東口店",
    address: "上福岡１－５－１",
    phone: "049-264-1122",
    category: "その他",
    menu: "新鮮な国産生野菜を使用したジューシーな本格モスバーガー",
    couponType: "both", lat: 35.88109039837035, lng: 139.50791545725852
  },
  {
    id: 229,
    name: "吉野家 ２５４号線大井店",
    address: "大井中央２－３－４",
    phone: "049-267-3322",
    category: "その他",
    menu: "秘伝のタレでじっくり煮込んだ牛肉とご飯が絶妙な牛丼並盛",
    couponType: "a_only", lat: 35.874725136064356, lng: 139.51880896036985
  },
  {
    id: 230,
    name: "松屋 上福岡店",
    address: "上福岡１－２－８",
    phone: "049-256-5544",
    category: "その他",
    menu: "ジューシーな牛肉と特製タレが美味しい定番牛めしと味噌汁",
    couponType: "both", lat: 35.87666555987893, lng: 139.51633619310635
  },
  {
    id: 231,
    name: "なか卯 上福岡店",
    address: "上福岡３－１－１",
    phone: "049-261-0099",
    category: "和食・そば・うどん",
    menu: "こだわり卵をたっぷり使用したふわとろ食感の絶品親子丼",
    couponType: "both", lat: 35.87988381326889, lng: 139.51873686904148
  },
  {
    id: 232,
    name: "カレーハウスCoCo壱番屋 ふじみ野大井店",
    address: "ふじみ野３－１－１２",
    phone: "049-269-5566",
    category: "洋食・イタリアン",
    menu: "お好みのトッピングと辛さが自由に選べる美味しいココイチカレー",
    couponType: "both", lat: 35.86934827431775, lng: 139.5120587525114
  },
  {
    id: 233,
    name: "ほっともっと ふじみ野大井店",
    address: "大井中央４－８－１",
    phone: "049-278-5500",
    category: "その他",
    menu: "揚げたてサクサクの特製から揚げが入った大人気のお弁当",
    couponType: "both", lat: 35.87260625628504, lng: 139.51867967052604
  },
  {
    id: 234,
    name: "つるやゴルフ ふじみ野店",
    address: "ふじみ野１－７－２",
    phone: "049-266-8800",
    category: "商業・ショッピング",
    menu: "最新のゴルフクラブから高機能なゴルフウェアまで各種ご用意",
    couponType: "both", lat: 35.880414545237, lng: 139.51638212013384
  },
  {
    id: 235,
    name: "洋服の青山 ふじみ野店",
    address: "うれし野１－３－１",
    phone: "049-263-4411",
    category: "商業・ショッピング",
    menu: "ビジネススーツやフォーマルウェアの高品質な紳士服・婦人服",
    couponType: "a_only", lat: 35.869476632089274, lng: 139.51165228703474
  },
  {
    id: 236,
    name: "AOKI ふじみ野店",
    address: "ふじみ野２－２５－１",
    phone: "049-264-5533",
    category: "商業・ショッピング",
    menu: "メンズ・レディースの自宅で洗えるスーツやオフィスカジュアル",
    couponType: "a_only", lat: 35.87996202777825, lng: 139.50814011638062
  },
  {
    id: 237,
    name: "眼鏡市場 ふじみ野店",
    address: "ふじみ野３－８－１５",
    phone: "049-267-2200",
    category: "商業・ショッピング",
    menu: "追加料金なしでお選びいただける高品質なレンズ付きメガネ一式",
    couponType: "both", lat: 35.87344499575086, lng: 139.50827105158817
  },
  {
    id: 238,
    name: "サイクルベースあさひ ふじみ野店",
    address: "鶴ヶ岡２－２８－５",
    phone: "049-256-3388",
    category: "商業・ショッピング",
    menu: "通勤通学に最適な電動アシスト自転車の販売と安心点検修理",
    couponType: "a_only", lat: 35.87365825354535, lng: 139.50901409131893
  },
  {
    id: 239,
    name: "ゲオ 上福岡店",
    address: "上福岡５－６－１０",
    phone: "049-261-8844",
    category: "商業・ショッピング",
    menu: "最新ゲームソフトの販売買取や中古スマートフォンの格安販売",
    couponType: "both", lat: 35.86741006527728, lng: 139.50500486276408
  },
  {
    id: 240,
    name: "ブックオフ 上福岡西口店",
    address: "霞ヶ丘２－２－１",
    phone: "049-262-1100",
    category: "商業・ショッピング",
    menu: "コミックや実用書、小説など中古本の格安販売と不要品買取",
    couponType: "both", lat: 35.87615472220771, lng: 139.5059741277961
  },
  {
    id: 241,
    name: "サミットストア 上福岡東口店",
    address: "大原１－１２－２０",
    phone: "049-263-1200",
    category: "スーパー・食料品",
    menu: "新鮮な精肉や鮮魚と毎日店内の窯で焼き上げる手作りパン",
    couponType: "a_only", lat: 35.88077427952504, lng: 139.5102482979032
  },
  {
    id: 242,
    name: "スギドラッグ 大井店",
    address: "大井２－１１－１",
    phone: "049-264-4112",
    category: "ドラッグストア",
    menu: "ヘルスケア商品から健康食品、日用雑貨の充実した品揃え",
    couponType: "a_only", lat: 35.87915682140316, lng: 139.51047744446262
  },
  {
    id: 243,
    name: "ウエルシア ふじみ野大井店",
    address: "鶴ヶ岡４－１－１",
    phone: "049-265-2244",
    category: "ドラッグストア",
    menu: "深夜まで営業している処方箋受付対応の調剤併設ドラッグストア",
    couponType: "a_only", lat: 35.87761776775943, lng: 139.507911846759
  },
  {
    id: 244,
    name: "クリエイトSD ふじみ野亀久保店",
    address: "亀久保２－２２－１",
    phone: "049-266-9911",
    category: "ドラッグストア",
    menu: "毎日の健康と生活を支える各種お薬と豊富な冷凍食品や日用品",
    couponType: "a_only", lat: 35.86963087830581, lng: 139.50476474281416
  },
  {
    id: 245,
    name: "スターバックスコーヒー ふじみ野店",
    address: "うれし野２－１６－１",
    phone: "049-278-7711",
    category: "カフェ・喫茶",
    menu: "ドライブスルー併設店舗で楽しむ淹れたてドリップコーヒー",
    couponType: "a_only", lat: 35.87368795274653, lng: 139.5112683997498
  },
  {
    id: 246,
    name: "コメダ珈琲店 ふじみ野店",
    address: "亀久保１－１０－１",
    phone: "049-269-2233",
    category: "カフェ・喫茶",
    menu: "ほかほかデニッシュパンの上に冷たいソフトクリームが乗った一品",
    couponType: "both", lat: 35.87097896820293, lng: 139.51362441017412
  },
  {
    id: 247,
    name: "星乃珈琲店 ふじみ野店",
    address: "鶴ヶ岡２－１－１",
    phone: "049-261-3311",
    category: "カフェ・喫茶",
    menu: "ご注文後に一枚ずつ丁寧に焼き上げた名物の極厚スフレパンケーキ",
    couponType: "both", lat: 35.87223468056149, lng: 139.5124692270433
  },
  {
    id: 248,
    name: "ブロンコビリー ふじみ野店",
    address: "ふじみ野１－８－４０",
    phone: "049-263-2941",
    category: "焼肉・肉料理",
    menu: "備長炭で香ばしく焼き上げたジューシーなハンバーグと新鮮サラダバー",
    couponType: "both", lat: 35.87589008238025, lng: 139.50711352420376
  },
  {
    id: 249,
    name: "焼肉きんぐ ふじみ野店",
    address: "鶴ヶ岡２－２５－２５",
    phone: "049-256-8929",
    category: "焼肉・肉料理",
    menu: "大満足の食べ放題コースで味わうカルビやロース、牛タン塩",
    couponType: "a_only", lat: 35.87865941843533, lng: 139.51065832144914
  },
  {
    id: 250,
    name: "安楽亭 大井店",
    address: "亀久保２－１６－１",
    phone: "049-264-4129",
    category: "焼肉・肉料理",
    menu: "安全安心な100%無添加たれで食べるお買い得な炭火焼肉ランチ",
    couponType: "both", lat: 35.87571529379673, lng: 139.51592040148984
  },
  {
    id: 251,
    name: "ぎょうざの満洲 上福岡西口店",
    address: "霞ヶ丘１－２－２",
    phone: "049-263-2281",
    category: "ラーメン・中華",
    menu: "自家製のモチモチ皮を使用したボリューム満点のダブル餃子定食",
    couponType: "both", lat: 35.88054750464371, lng: 139.50844447243165
  },
  {
    id: 252,
    name: "洋麺屋五右衛門 ふじみ野店",
    address: "うれし野２－６－１",
    phone: "049-261-0555",
    category: "洋食・イタリアン",
    menu: "和風から洋風まで創作性豊かなお箸で食べる茹でたてスパゲッティ",
    couponType: "both", lat: 35.87326978840077, lng: 139.51324640121246
  },
  {
    id: 253,
    name: "鎌倉パスタ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-265-8833",
    category: "洋食・イタリアン",
    menu: "最高級デュラム粉を使用したもちもち食感が自慢の本格生パスタ",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88054022163714, lng: 139.52180129549157
  },
  {
    id: 254,
    name: "和食さと ふじみ野店",
    address: "大井中央１－３－３",
    phone: "049-262-6655",
    category: "和食・そば・うどん",
    menu: "しゃぶしゃぶや和食お惣菜の食べ放題が人気のファミリーレストラン",
    couponType: "both", lat: 35.8729719695657, lng: 139.51502217721372
  },
  {
    id: 255,
    name: "しゃぶ葉 ふじみ野店",
    address: "うれし野２－５－２",
    phone: "049-264-9988",
    category: "焼肉・肉料理",
    menu: "新鮮な厳選お野菜が食べ放題のヘルシーでお得な豚しゃぶしゃぶコース",
    couponType: "both", lat: 35.87042007497544, lng: 139.50961678586157
  },
  {
    id: 256,
    name: "びっくりドンキー ふじみ野店",
    address: "うれし野１－８－１",
    phone: "049-261-4129",
    category: "洋食・イタリアン",
    menu: "木製ワンプレートに盛られた和風ベースの味わい深いハンバーグ",
    couponType: "both", lat: 35.8737988962092, lng: 139.5058739019684
  },
  {
    id: 257,
    name: "ドン・キホーテ UNY大井店",
    address: "大井中央４－１－１",
    phone: "049-278-3811",
    category: "商業・ショッピング",
    menu: "驚安価格のこだわり食料品や日用生活雑貨を圧倒的品揃えでご提供",
    couponType: "a_only", lat: 35.86755776229448, lng: 139.5128417453192
  },
  {
    id: 258,
    name: "ケーズデンキ ふじみ野店",
    address: "うれし野１－４－１",
    phone: "049-269-8511",
    category: "商業・ショッピング",
    menu: "その場での現金値引きが嬉しい最新家電製品と充実の長期無料保証",
    couponType: "a_only", lat: 35.87626199524656, lng: 139.51324259604885
  },
  {
    id: 259,
    name: "ノジマ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-256-7711",
    category: "商業・ショッピング",
    menu: "メーカー販売員不在の、お客様に寄り添った丁寧な家電コンサルティング",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88058097185408, lng: 139.52192561726363
  },
  {
    id: 260,
    name: "ヤオコー ふじみ野大原店",
    address: "大原２－１－３０",
    phone: "049-261-8050",
    category: "スーパー・食料品",
    menu: "こだわりのお惣菜コーナーと新鮮な生鮮食品、ベーカリー",
    couponType: "a_only", lat: 35.86666653100816, lng: 139.50822311522487
  },
  {
    id: 261,
    name: "スターバックスコーヒー イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-1151",
    category: "カフェ・喫茶",
    menu: "ドリップコーヒーや季節限定のフラペチーノ、焼き菓子各種",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88060532033601, lng: 139.5218163586995
  },
  {
    id: 262,
    name: "丸亀製麺 ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-8851",
    category: "和食・そば・うどん",
    menu: "打ち立て茹でたての自家製うどんと熱々の天ぷら各種",
    couponType: "both", mall: "ビバモール埼玉大井", lat: 35.863931741910335, lng: 139.5021214049456
  },
  {
    id: 263,
    name: "マツモトキヨシ トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-269-1234",
    category: "ドラッグストア",
    menu: "医薬品、化粧品、日用品から健康食品まで幅広い品揃え",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.857173156338455, lng: 139.5246307661057
  },
  {
    id: 264,
    name: "餃子の満洲 上福岡駅前店",
    address: "上福岡１－２－４",
    phone: "049-256-3434",
    category: "ラーメン・中華",
    menu: "自家製の皮でもちもちのダブル餃子定食と国産野菜のタンメン",
    couponType: "both", lat: 35.873256547642164, lng: 139.5112965056309
  },
  {
    id: 265,
    name: "魚悦 ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-263-8901",
    category: "スーパー・食料品",
    menu: "鮮度抜群のお刺身盛り合わせと旬の魚介類、お惣菜",
    couponType: "a_only", mall: "ココネ上福岡", lat: 35.87331466782519, lng: 139.51088373548268
  },
  {
    id: 266,
    name: "マクドナルド イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-266-9876",
    category: "その他",
    menu: "人気のビッグマックやマックフライポテト、ハッピーセット",
    couponType: "a_only", mall: "イオン大井店", lat: 35.860291245684635, lng: 139.51433486674168
  },
  {
    id: 267,
    name: "ピアシティ整骨院",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-265-5432",
    category: "その他",
    menu: "肩こりや腰痛に効果的な骨盤矯正と丁寧なマッサージ施術",
    couponType: "both", mall: "ピアシティふじみ野", lat: 35.86362391237581, lng: 139.4995043372527
  },
  {
    id: 268,
    name: "サーティワンアイスクリーム トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-267-1131",
    category: "その他",
    menu: "季節限定フレーバーのアイスクリームやアイスクリームケーキ",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85701228201549, lng: 139.52462681437515
  },
  {
    id: 269,
    name: "サイゼリヤ ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-5561",
    category: "洋食・イタリアン",
    menu: "大人気のミラノ風ドリアや辛味チキン、パスタ各種",
    couponType: "both", mall: "ビバモール埼玉大井", lat: 35.8638554731303, lng: 139.50237219743042
  },
  {
    id: 270,
    name: "ドラッグセイムス ふじみ野苗間店",
    address: "苗間１－１２－５",
    phone: "049-256-8899",
    category: "ドラッグストア",
    menu: "常備薬からサプリメント、日用雑貨、飲料水のお買い得品",
    couponType: "a_only", lat: 35.87149860185114, lng: 139.51714000961613
  },
  {
    id: 271,
    name: "珍来 上福岡店",
    address: "上福岡２－３－５",
    phone: "049-261-4477",
    category: "ラーメン・中華",
    menu: "ボリューム満点の手打ちラーメンと香ばしいパラパラチャーハン",
    couponType: "both", lat: 35.87768408796114, lng: 139.50886701262826
  },
  {
    id: 272,
    name: "大戸屋ごはん処 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-3321",
    category: "和食・そば・うどん",
    menu: "黒酢あんかけの鶏と野菜の定食や焼き魚の和食メニュー各種",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88054139215191, lng: 139.52178247674826
  },
  {
    id: 273,
    name: "カルディコーヒーファーム トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-269-8800",
    category: "スーパー・食料品",
    menu: "こだわりのオリジナルコーヒー豆や世界の珍しい輸入食品",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.857176584760396, lng: 139.52450569026345
  },
  {
    id: 274,
    name: "庄や 上福岡東口店",
    address: "上福岡１－７－１０",
    phone: "049-263-4411",
    category: "居酒屋・バー",
    menu: "新鮮な産地直送の刺身盛り合わせと全国の美味しい地酒",
    couponType: "both", lat: 35.880579689790466, lng: 139.51043815052947
  },
  {
    id: 275,
    name: "サミットストア ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-264-2211",
    category: "スーパー・食料品",
    menu: "日替わりの特売肉や新鮮野菜、焼きたてパンの販売",
    couponType: "a_only", mall: "ココネ上福岡", lat: 35.87345567291008, lng: 139.51107690511287
  },
  {
    id: 276,
    name: "ロピア トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-267-2929",
    category: "スーパー・食料品",
    menu: "大容量でお買い得なメガ盛りパック肉や新鮮な果物野菜",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.85703842429594, lng: 139.52441090928033
  },
  {
    id: 277,
    name: "カフェ・ド・クリエ イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-266-3344",
    category: "カフェ・喫茶",
    menu: "淹れたてのドリップコーヒーとパスタ、季節のモンブランケーキ",
    couponType: "both", mall: "イオン大井店", lat: 35.860280603722956, lng: 139.51445825942207
  },
  {
    id: 278,
    name: "ダイソー ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-9901",
    category: "商業・ショッピング",
    menu: "便利な生活便利グッズや文房具、収納用品などの100円商品",
    couponType: "a_only", mall: "ビバモール埼玉大井", lat: 35.86394552258592, lng: 139.50229633658708
  },
  {
    id: 279,
    name: "マツモトキヨシ ピアシティふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-265-7788",
    category: "ドラッグストア",
    menu: "医薬品、サプリメント、ポイントが貯まる化粧品各種",
    couponType: "a_only", mall: "ピアシティふじみ野", lat: 35.86365678442124, lng: 139.49953848808232
  },
  {
    id: 280,
    name: "コメダ珈琲店 ふじみ野店",
    address: "うれし野１－４－５",
    phone: "049-269-5511",
    category: "カフェ・喫茶",
    menu: "名物のシロノワールとたっぷりのコメダブレンドコーヒー",
    couponType: "both", lat: 35.874329921688265, lng: 139.50819295198053
  },
  {
    id: 281,
    name: "スギ薬局 大井店",
    address: "大井中央３－１０－１",
    phone: "049-263-8833",
    category: "ドラッグストア",
    menu: "処方せん調剤の受付から一般医薬品、健康食品の販売",
    couponType: "a_only", lat: 35.88106537036596, lng: 139.51296958384253
  },
  {
    id: 282,
    name: "焼肉きんぐ ふじみ野店",
    address: "鶴ヶ岡２－２５－５",
    phone: "049-265-2929",
    category: "焼肉・肉料理",
    menu: "食べ放題で楽しめる名物きんぐカルビや厚切りロース",
    couponType: "both", lat: 35.87994268597507, lng: 139.50862892701252
  },
  {
    id: 283,
    name: "ミスタードーナツ ココネ上福岡ショップ",
    address: "霞ヶ丘１－２－３",
    phone: "049-263-5566",
    category: "カフェ・喫茶",
    menu: "定番人気のポン・デ・リングやエンゼルフレンチ、パイ各種",
    couponType: "both", mall: "ココネ上福岡", lat: 35.873223319094215, lng: 139.51086723704887
  },
  {
    id: 284,
    name: "餃子の王将 イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-4411",
    category: "ラーメン・中華",
    menu: "にんにくの効いた国産豚肉の餃子とパラパラ炒飯",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.880490293158765, lng: 139.52175135717692
  },
  {
    id: 285,
    name: "ドトールコーヒーショップ 上福岡駅前店",
    address: "上福岡１－２－１",
    phone: "049-261-0011",
    category: "カフェ・喫茶",
    menu: "定番のミラノサンドAと味わい深いホットマイルドブレンド",
    couponType: "both", lat: 35.873669062922566, lng: 139.51343505401582
  },
  {
    id: 286,
    name: "ヤオコー ふじみ野東店",
    address: "駒林元町１－８－１",
    phone: "049-267-3311",
    category: "スーパー・食料品",
    menu: "こだわりのお惣菜コーナーと新鮮な生鮮食品、ベーカリー",
    couponType: "a_only", lat: 35.878676643016824, lng: 139.50933428948312
  },
  {
    id: 287,
    name: "かっぱ寿司 ふじみ野店",
    address: "駒林元町１－９－２８",
    phone: "049-267-8899",
    category: "和食・寿司・魚料理",
    menu: "一皿110円から楽しめるバラエティ豊かな人気ネタの回転寿司",
    couponType: "both", lat: 35.86823497222338, lng: 139.5058768384
  },
  {
    id: 288,
    name: "コジマ×ビックカメラ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-0051",
    category: "商業・ショッピング",
    menu: "最新家電製品、スマートフォン、テレビや生活家電の販売",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88054426736602, lng: 139.52186456706656
  },
  {
    id: 289,
    name: "ケンタッキーフライドチキン イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-266-1188",
    category: "その他",
    menu: "秘伝のスパイスで仕上げたオリジナルチキンとポテトセット",
    couponType: "both", mall: "イオン大井店", lat: 35.86029295834952, lng: 139.51443582416587
  },
  {
    id: 290,
    name: "クリーニングたんぽぽ 上福岡店",
    address: "霞ヶ丘２－５－８",
    phone: "049-263-1212",
    category: "その他",
    menu: "即日仕上げ対応のワイシャツクリーニングと丁寧なシミ抜き",
    couponType: "both", lat: 35.87779122466839, lng: 139.50682017589455
  },
  {
    id: 291,
    name: "手打ちうどん・そば 鶴よし",
    address: "鶴ヶ岡３－５－１２",
    phone: "049-264-5544",
    category: "和食・そば・うどん",
    menu: "コシの強い手打ちの武蔵野うどんとサクサク天ぷらのセット",
    couponType: "both", lat: 35.87814559999465, lng: 139.51329615921864
  },
  {
    id: 292,
    name: "ガスト ふじみ野店",
    address: "亀久保２－１４－３",
    phone: "049-265-7711",
    category: "洋食・イタリアン",
    menu: "とろけるチーズINハンバーグやお得な日替わりランチメニュー",
    couponType: "both", lat: 35.870823113669715, lng: 139.50598183859356
  },
  {
    id: 293,
    name: "トイザらス・ベビーザらス トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-269-3400",
    category: "商業・ショッピング",
    menu: "子ども向けおもちゃ、知育玩具、ベビー用品の圧倒的な品揃え",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.85727058066266, lng: 139.52448228267343
  },
  {
    id: 294,
    name: "カレーハウスCoCo壱番屋 東武上福岡駅西口店",
    address: "霞ヶ丘１－４－２",
    phone: "049-263-5599",
    category: "洋食・イタリアン",
    menu: "トッピングや辛さが選べる特製ポークカレーとロースカツカレー",
    couponType: "both", lat: 35.87993380218281, lng: 139.51857634710015
  },
  {
    id: 295,
    name: "魚民 上福岡東口駅前店",
    address: "上福岡１－６－３",
    phone: "049-261-5588",
    category: "居酒屋・バー",
    menu: "個室空間で楽しむ枝豆や焼き鳥、お刺身盛り合わせの居酒屋定番",
    couponType: "both", lat: 35.875833652449224, lng: 139.50763860437377
  },
  {
    id: 296,
    name: "クリエイトS・D ふじみ野大井東店",
    address: "大井東１－８－１",
    phone: "049-263-9988",
    category: "ドラッグストア",
    menu: "お買い得な日用品、化粧品、冷凍食品や人気のサプリメント",
    couponType: "a_only", lat: 35.878594673554, lng: 139.51234738152212
  },
  {
    id: 297,
    name: "ノジマ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-1100",
    category: "商業・ショッピング",
    menu: "エアコン、冷蔵庫、最新パソコンなどの相談ができる家電量販店",
    couponType: "a_only", mall: "イオンタウンふじみ野", lat: 35.88063314012129, lng: 139.52182025309222
  },
  {
    id: 298,
    name: "リンガーハット イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-2255",
    category: "ラーメン・中華",
    menu: "国産野菜をたっぷり480g使用した長崎ちゃんぽん",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88060839640695, lng: 139.52176808381319
  },
  {
    id: 299,
    name: "モスバーガー トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-267-3344",
    category: "その他",
    menu: "新鮮な生野菜を使用したモスバーガーと手作りテリヤキバーガー",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85728328985048, lng: 139.52455810959538
  },
  {
    id: 300,
    name: "ウエルシア ふじみ野うれし野店",
    address: "うれし野２－１－３",
    phone: "049-269-7755",
    category: "ドラッグストア",
    menu: "深夜まで営業している調剤薬品、コスメ、日用消耗品の店",
    couponType: "a_only", lat: 35.87005054314106, lng: 139.51137667143487
  },
  {
    id: 301,
    name: "くら寿司 ふじみ野店",
    address: "市沢１－１－２",
    phone: "049-293-1100",
    category: "和食・寿司・魚料理",
    menu: "無添加にこだわった新鮮な寿司ネタとびっくらポンのお楽しみ",
    couponType: "both", lat: 35.87835313012006, lng: 139.50727299105458
  },
  {
    id: 302,
    name: "築地銀だこ ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-7722",
    category: "お好み焼き・たこ焼き",
    menu: "皮はパリッと中はトロッとした食感のこだわりたこ焼き",
    couponType: "both", mall: "ビバモール埼玉大井", lat: 35.86396708248115, lng: 139.50221787841406
  },
  {
    id: 303,
    name: "ブックオフ スーパーバザー ビバモール埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-3388",
    category: "商業・ショッピング",
    menu: "本、中古衣類、家電、おもちゃやブランド品の買取と販売",
    couponType: "a_only", mall: "ビバモール埼玉大井", lat: 35.86385890174571, lng: 139.50219234726225
  },
  {
    id: 304,
    name: "風風ラーメン 上福岡店",
    address: "上福岡１－２－２３",
    phone: "049-261-9988",
    category: "ラーメン・中華",
    menu: "コクのある豚骨ラーメンとしっとりパラパラの特製半チャーハン",
    couponType: "both", lat: 35.879976737520764, lng: 139.50861762419117
  },
  {
    id: 305,
    name: "珈琲館 ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-263-0099",
    category: "カフェ・喫茶",
    menu: "伝統の銅板で焼き上げるホットケーキと香り高い炭火珈琲",
    couponType: "both", mall: "ココネ上福岡", lat: 35.87344534669727, lng: 139.51099094917123
  },
  {
    id: 306,
    name: "サンドラッグ ふじみ野店",
    address: "ふじみ野４－８－５",
    phone: "049-278-1122",
    category: "ドラッグストア",
    menu: "健康的な生活を応援する医薬品、サプリ、お値打ちの化粧品",
    couponType: "a_only", lat: 35.87601144253038, lng: 139.5142443742488
  },
  {
    id: 307,
    name: "スターバックス コーヒー トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-269-2233",
    category: "カフェ・喫茶",
    menu: "お好みのカスタマイズで楽しむラテや季節のペストリー",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.85712409675024, lng: 139.5245559139131
  },
  {
    id: 308,
    name: "しゃぶ葉 ふじみ野店",
    address: "ふじみ野１－７－２",
    phone: "049-278-5544",
    category: "和食・そば・うどん",
    menu: "選べるお出汁で食べる豚肉や牛肉、新鮮野菜のしゃぶしゃぶ食べ放題",
    couponType: "both", lat: 35.873535033523325, lng: 139.50427059637647
  },
  {
    id: 309,
    name: "ヤオコー ピアシティふじみ野店",
    address: "西鶴ヶ岡２－３－１",
    phone: "049-265-1155",
    category: "スーパー・食料品",
    menu: "豊富なお弁当、手作りお惣菜、新鮮な生鮮食料品の品揃え",
    couponType: "a_only", mall: "ピアシティふじみ野", lat: 35.863635113656755, lng: 139.4995852140278
  },
  {
    id: 310,
    name: "QBハウス イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-266-5544",
    category: "その他",
    menu: "短時間でスマートに仕上がる、カット専門店のヘアカットサービス",
    couponType: "both", mall: "イオン大井店", lat: 35.860058118168325, lng: 139.51440994721384
  },
  {
    id: 311,
    name: "洋服の青山 ふじみ野店",
    address: "亀久保３－１２－３",
    phone: "049-265-3311",
    category: "商業・ショッピング",
    menu: "高品質なビジネススーツ、リクルートフォーマル、カジュアルウェア",
    couponType: "a_only", lat: 35.871274073426754, lng: 139.51380539302409
  },
  {
    id: 312,
    name: "夢庵 ふじみ野店",
    address: "鶴ヶ岡２－２－１８",
    phone: "049-264-9988",
    category: "和食・そば・うどん",
    menu: "お祝いの席にも最適なすき焼きや天ぷら、和食御膳各種",
    couponType: "both", lat: 35.880082007751916, lng: 139.51626444956523
  },
  {
    id: 313,
    name: "タリーズコーヒー イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-5500",
    category: "カフェ・喫茶",
    menu: "豆にこだわった本物のエスプレッソとパスタなどの軽食メニュー",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88067385114588, lng: 139.52189213190627
  },
  {
    id: 314,
    name: "ライトオン トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-269-8101",
    category: "商業・ショッピング",
    menu: "人気ブランドのジーンズや着回しの効くトレンドカジュアルウェア",
    couponType: "a_only", mall: "トナリエふじみ野", lat: 35.85712425299127, lng: 139.52460561286756
  },
  {
    id: 315,
    name: "クスリのアオキ 苗間店",
    address: "苗間３－１－２２",
    phone: "049-257-2211",
    category: "ドラッグストア",
    menu: "お薬の調剤から日用雑貨、冷凍食品、お酒までのお得な販売",
    couponType: "a_only", lat: 35.867162214103274, lng: 139.5171850580523
  },
  {
    id: 316,
    name: "徳樹庵 ふじみ野店",
    address: "うれし野１－３－１",
    phone: "049-269-6611",
    category: "和食・そば・うどん",
    menu: "個室で楽しむこだわり蕎麦と多彩なミニ丼のセットメニュー",
    couponType: "both", lat: 35.86811031640197, lng: 139.50443983874132
  },
  {
    id: 317,
    name: "安楽亭 大井店",
    address: "大井中央４－１－５",
    phone: "049-263-1129",
    category: "焼肉・肉料理",
    menu: "お求めやすい価格で楽しめる100%無添加の焼肉ランチセット",
    couponType: "both", lat: 35.881571724402455, lng: 139.5085169337277
  },
  {
    id: 318,
    name: "はなまるうどん ココネ上福岡店",
    address: "霞ヶ丘１－２－３",
    phone: "049-263-8700",
    category: "和食・そば・うどん",
    menu: "讃岐うどんのおいしさを追求した温かいかけうどんと天ぷら",
    couponType: "both", mall: "ココネ上福岡", lat: 35.87346784206022, lng: 139.51108184308836
  },
  {
    id: 319,
    name: "ミスターマックス おおい店",
    address: "大井２－１９－１",
    phone: "049-263-0051",
    category: "商業・ショッピング",
    menu: "ディスカウント価格で揃う家電、日用品、衣類、食料品各種",
    couponType: "a_only", lat: 35.87136717514327, lng: 139.51373099687342
  },
  {
    id: 320,
    name: "すき家 ふじみ野店",
    address: "駒林２－３－４",
    phone: "049-261-0088",
    category: "和食・そば・うどん",
    menu: "人気の牛丼並盛や、とろ〜り3種のチーズ牛丼などのバラエティ",
    couponType: "both", lat: 35.87009886835354, lng: 139.51786512723976
  },
  {
    id: 321,
    name: "サーティワンアイスクリーム イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-3131",
    category: "その他",
    menu: "様々なフレーバーから選べるアイスクリームと冷たいクレープ",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88062631835085, lng: 139.521893373985
  },
  {
    id: 322,
    name: "スギ薬局 上福岡西口店",
    address: "霞ヶ丘１－４－１",
    phone: "049-263-9911",
    category: "ドラッグストア",
    menu: "処方せん調剤、お薬の相談、基礎化粧品や日用生活雑貨の販売",
    couponType: "a_only", lat: 35.867507942756774, lng: 139.51600492943885
  },
  {
    id: 323,
    name: "鎌倉パスタ トナリエふじみ野店",
    address: "うれし野２－10－８７",
    phone: "049-267-8833",
    category: "洋食・イタリアン",
    menu: "特製和風出汁を使用したもちもち食感の生パスタと焼きたてパン",
    couponType: "both", mall: "トナリエふじみ野", lat: 35.85706121799194, lng: 139.52444561315707
  },
  {
    id: 324,
    name: "ビバホーム 埼玉大井店",
    address: "西鶴ヶ岡１－３－１５",
    phone: "049-264-5111",
    category: "商業・ショッピング",
    menu: "住まいの補修資材からインテリア、ガーデニング用品まで揃う",
    couponType: "a_only", mall: "ビバモール埼玉大井", lat: 35.863930712858895, lng: 139.50211668458277
  },
  {
    id: 325,
    name: "セカンドストリート ふじみ野店",
    address: "ふじみ野２－２５－１",
    phone: "049-278-5000",
    category: "商業・ショッピング",
    menu: "ブランド古着、家電、ブランドバッグの買取および販売",
    couponType: "a_only", lat: 35.8793292129767, lng: 139.51496564864863
  },
  {
    id: 326,
    name: "おおぎやラーメン 埼玉大井店",
    address: "大井中央３－１－１",
    phone: "049-263-4488",
    category: "ラーメン・中華",
    menu: "濃厚でコクのある味噌ラーメンと、ニンニクが効いた手作り餃子",
    couponType: "both", lat: 35.87597096270312, lng: 139.51566984551124
  },
  {
    id: 327,
    name: "ほっともっと ふじみ野大原店",
    address: "大原１－１２－２",
    phone: "049-261-2299",
    category: "その他",
    menu: "炊きたてご飯と揚げたてチキンの定番のり弁当、から揚弁当",
    couponType: "both", lat: 35.87220195130733, lng: 139.51637544948449
  },
  {
    id: 328,
    name: "コープみらい コープふじみ野店",
    address: "うれし野２－２－１",
    phone: "049-269-1151",
    category: "スーパー・食料品",
    menu: "安心安全なコープの産直野菜やプライベートブランドのお肉とお魚",
    couponType: "a_only", lat: 35.87284708846517, lng: 139.5133460711753
  },
  {
    id: 329,
    name: "モスバーガー イオン大井店",
    address: "ふじみ野１－２－１",
    phone: "049-266-8800",
    category: "その他",
    menu: "国産牛100%を使用したリッチな味わいのとびきりハンバーグサンド",
    couponType: "both", mall: "イオン大井店", lat: 35.860041727481075, lng: 139.51450574549634
  },
  {
    id: 330,
    name: "寿し和 上福岡店",
    address: "上福岡１－１４－２",
    phone: "049-261-2233",
    category: "和食・寿司・魚料理",
    menu: "職人が目の前で握る極上の本マグロ大トロと季節の鮮魚握り",
    couponType: "both", lat: 35.87525232386439, lng: 139.5110300949649
  },
  {
    id: 331,
    name: "ドラッグストアセキ ふじみ野店",
    address: "市沢２－５－２",
    phone: "049-293-8855",
    category: "ドラッグストア",
    menu: "地域密着のポイントカードがお得な医薬品、コスメ、日用品の販売",
    couponType: "a_only", lat: 35.87242585586245, lng: 139.50493419686
  },
  {
    id: 332,
    name: "サンマルクカフェ イオンタウンふじみ野店",
    address: "福岡２－１－６",
    phone: "049-262-1110",
    category: "カフェ・喫茶",
    menu: "焼きたてのサクサクチョコクロと味わい分子深いブレンドコーヒー",
    couponType: "both", mall: "イオンタウンふじみ野", lat: 35.88049477509813, lng: 139.52181849059141
  }
];

const RESTAURANT_GENRES = [
  "和食・そば・うどん",
  "和食・寿司・魚料理",
  "洋食・イタリアン",
  "ラーメン・中華",
  "焼肉・肉料理",
  "居酒屋・バー",
  "カフェ・喫茶",
  "お好み焼き・たこ焼き"
];

export const RESTAURANTS: Restaurant[] = RAW_RESTAURANTS.map((r) => {
  const coords = ADDRESS_COORDINATES[r.address] || { lat: 35.879, lng: 139.514 }; // fallback to Kamifukuoka Station
  const isRestaurant = RESTAURANT_GENRES.includes(r.category);
  return {
    ...r,
    address: r.address.startsWith("埼玉県ふじみ野市") ? r.address : "埼玉県ふじみ野市" + r.address,
    category: isRestaurant ? "飲食店" : r.category,
    subCategory: isRestaurant ? r.category : undefined,
    lat: r.lat || coords.lat,
    lng: r.lng || coords.lng
  };
});

export const CATEGORIES = [
  "すべて",
  "飲食店",
  "スーパー・食料品",
  "ドラッグストア",
  "商業・ショッピング",
  "その他"
];
